// @flow
type defaultCellType = {
  isComposite?: false,
  value: Array<Array<string>>,
}

type compositeCellType = {
  isComposite: true,
  value: Array<Array<{ value: string, attr?: any }>>,
}

export type tableType = {
  KEY: string,
  NAME?: string,
  DATA: {
    header: compositeCellType | defaultCellType,
    body: any,
  },
  addition?: Array<string>,
}

export const TABLES: Array<tableType> = [
  {
    KEY: 'table 1-1',
    NAME: 'Таблица 1-1: Модификаторы параметров и бонусные заклинания',
    DATA: {
      header: {
        isComposite: true,
        value: [
          [
            {
              value: 'Показатель',
              attr: {
                rowSpan: 2,
              },
            },
            {
              value: 'Модификатор',
              attr: {
                rowSpan: 2,
              },
            },
            {
              value: 'Бонусные заклинания (По уровню заклинаний)',
              attr: {
                colSpan: 10,
              },
            },
          ],
          [
            { value: '0' },
            { value: '1' },
            { value: '2' },
            { value: '3' },
            { value: '4' },
            { value: '5' },
            { value: '6' },
            { value: '7' },
            { value: '8' },
            { value: '9' },
          ],
        ],
      },
      body: [
        ['1', '-5', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-'],
        ['2-3', '-4', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-'],
        ['4-5', '-3', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-'],
        ['6-7', '-2', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-'],
        ['8-9', '-1', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-'],
        ['10-11', '0', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-'],
        ['12-13', '+1', '1', '-', '-', '-', '-', '-', '-', '-', '-', '-'],
        ['14-15', '+2', '1', '1', '-', '-', '-', '-', '-', '-', '-', '-'],
        ['16-17', '+3', '1', '1', '1', '-', '-', '-', '-', '-', '-', '-'],
        ['18-19', '+4', '1', '1', '1', '1', '-', '-', '-', '-', '-', '-'],
        ['20-21', '+5', '2', '1', '1', '1', '1', '-', '-', '-', '-', '-'],
        ['22-23', '+6', '2', '2', '1', '1', '1', '1', '-', '-', '-', '-'],
        ['24-25', '+7', '2', '2', '2', '1', '1', '1', '1', '-', '-', '-'],
        ['26-27', '+8', '2', '2', '2', '2', '1', '1', '1', '1', '-', '-'],
        ['28-29', '+9', '3', '2', '2', '2', '2', '1', '1', '1', '1', '-'],
        ['30-31', '+10', '3', '3', '2', '2', '2', '2', '1', '1', '1', '1'],
      ],
    },
  },
  {
    KEY: 'table 1-2',
    NAME: 'Средние Показатели Силы',
    DATA: {
      header: {
        value: [['Раса или Существо', 'Средняя Сила', 'Средний Модификатор']],
      },
      body: [
        ['Аллип, волшебный огонек, тень', '-', '-'],
        ['Архон светлячок, летучая мышь, жаба', '1', '-5'],
        ['Рой крыс', '2', '-4'],
        ['Жужжала, крошечный ужасный паук, обезьяна', '3', '-4'],
        ['Григ, маленькая ужасная сороконожка', '4-5', '-3'],
        ['Кокатрис, пикси, ястреб', '6-7', '-2'],
        ['Квазит, барсук', '8-9', '-1'],
        ['Человек, бихолдер, жуткая крыса', '10-11', '+0'],
        ['Майнд флаер, собака, пони, упырь', '12-13', '+1'],
        ['Гнолл, жуткий барсук, бабуин, скат', '14-15', '+2'],
        ['Черный пудинг, чокер, Большая акула', '16-17', '+3'],
        ['Кентавр, минотавр, сместитель', '18-19', '+4'],
        ['Горилла, голем из плоти, горгона, огр', '20-21', '+5'],
        ['Огненный великан, трицератопс, слон', '30-31', '+10'],
        ['Великий вирм золотого дракона', '46-47', '+18'],
      ],
    },
  },
  {
    KEY: 'table 1-3',
    NAME: 'Средние Показатели Ловкости',
    DATA: {
      header: {
        value: [
          ['Раса или Существо', 'Средняя Ловкость', 'Средний Модификатор'],
        ],
      },
      body: [
        ['Визгун (гриб)', '-', '-'],
        ['Желатиновый куб (слизь)', '1', '-5'],
        ['Колоссальный оживленный объект', '4-5', '-3'],
        ['Зомби огра, пурпурный червь', '6-7', '-2'],
        ['Василиск, огненный великан, огр, тендрикулюс', '8-9', '-1'],
        ['Гигантский огненный жук, кабан, тритон, человек', '10-11', '+0'],
        ['Ламмасу, медвежатник, хобгоблин', '12-13', '+1'],
        ['Гиерасфинкс, сместитель', '14-15', '+2'],
        ['Лев, мерцающая собака, призрак, осьминог', '16-17', '+3'],
        ['Астральная дева (ангел), эфирный похититель', '18-19', '+4'],
        ['Костяной дьявол, стрелоястреб', '20-21', '+5'],
        ['Старейшая воздушная элементаль', '32-33', '+11'],
      ],
    },
  },
  {
    KEY: 'table 1-4',
    NAME: 'Средние Показатели Телосложения',
    DATA: {
      header: {
        value: [
          ['Раса или Существо', 'Среднee Телосложениe', 'Средний Модификатор'],
        ],
      },
      body: [
        ['Мумия, тень, упырь', '-', '-'],
        ['Рой саранчи, рой сороконожек', '8-9', '-1'],
        ['Бес, грик, жуткая ласка, человек', '10-11', '+0'],
        ['Медуза, нимфа, отидж, ржавочудище', '12-13', '+1'],
        ['Легкая лошадь, русал, троглодит', '14-15', '+2'],
        ['Подлая лоза, тигр, химера', '16-17', '+3'],
        ['Белый медведь, горгулья, умбер халк', '18-19', '+4'],
        ['Аболет, слон, тираннозавр', '20-21', '+5'],
        ['Тарраскью', '35', '+12'],
      ],
    },
  },
  {
    KEY: 'table 1-5',
    NAME: 'Средние Показатели Интеллекта',
    DATA: {
      header: {
        value: [
          ['Раса или Существо', 'Средний Интеллект', 'Средний Модификатор'],
        ],
      },
      body: [
        ['Голем, зомби, охровое желе', '-', '-'],
        ['Верблюд, карабкающийся падальщик, пурпурный червь', '1', '-5'],
        ['Гидра, лошадь, собака, тигр', '2', '-4'],
        ['Серый рендер, раст, тендрикулюс', '3', '-4'],
        ['Грифон, отидж, сместитель', '4-5', '-3'],
        ['Адская гончая, йарфак, огр, тролль', '6-7', '-2'],
        ['Гнолл, кентавр, троглодит', '8-9', '-1'],
        ['Вайт, ночная ведьма, медвежатник, человек', '10-11', '+0'],
        ['Дракочерепаха, ламия, облачный великан', '12-13', '+1'],
        ['Волшебный огонек, невидимый преследователь, призрак', '14-15', '+2'],
        ['Архон триумфатор, бихолдер, суккубус', '16-17', '+3'],
        ['Майнд флаер, ночное крыло, смертельный слаад', '18-19', '+4'],
        ['Кракен, ночной подкрадыватель, титан', '20-21', '+5'],
        ['Великий вирм золотого дракона', '32-33', '+11'],
      ],
    },
  },
  {
    KEY: 'table 1-6',
    NAME: 'Средние Показатели Мудрости',
    DATA: {
      header: {
        value: [
          ['Раса или Существо', 'Средняя Мудрость', 'Средний Модификатор'],
        ],
      },
      body: [
        ['Желатиновый куб (слизь), оживленный объект', '1', '-5'],
        ['Визгун (гриб)', '2', '-4'],
        ['Гизьянка, красный слаад', '6-7', '-2'],
        ['Гримлок, пурпурный червь, тролль', '8-9', '-1'],
        ['Людоящер, призрачный гриб, человек', '10-11', '+0'],
        ['Гиена, реморхаз, совомедведь, тень', '12-13', '+1'],
        ['Гигантский богомол, призрак, сова', '14-15', '+2'],
        ['Андросфинкс, лилленд, поглотитель', '16-17', '+3'],
        ['Коатль, нага страж, эриньез (дьявол)', '18-19', '+4'],
        ['Единорог, штормовой великан', '20-21', '+5'],
        ['Великий вирм золотого дракона', '32-33', '+11'],
      ],
    },
  },
  {
    KEY: 'table 1-7',
    NAME: 'Средние Показатели Обаяния',
    DATA: {
      header: {
        value: [
          ['Раса или Существо', 'Среднее Обаяние', 'Средний Модификатор'],
        ],
      },
      body: [
        ['Визгун (гриб), голем, зомби', '1', '-5'],
        ['Крокодил, носорог, паук, ящерица', '2', '-4'],
        ['Осьминог, тендрикулюс', '3', '-4'],
        ['Жуткая крыса, ласка, осел, чуул', '4-5', '-3'],
        ['Барсук, гигантский огненный жук, медведь, тролль', '6-7', '-2'],
        ['Гнолл, горгона, жуткий кабан, мантикора', '8-9', '-1'],
        ['Дретч (демон), росомаха, человек', '10-11', '+0'],
        ['Доппельгангер, ночная ведьма, подсекатель, триант', '12-13', '+1'],
        ['Барджест, медуза, штормовой великан', '14-15', '+2'],
        ['Ахайрай, гарпия, огр маг, пикси', '16-17', '+3'],
        ['Великий барджест, никси', '18-19', '+4'],
        ['Астральная дева (ангел), кракен', '20-21', '+5'],
        ['Великий вирм золотого дракона', '30-31', '+11'],
      ],
    },
  },
  {
    KEY: 'table 2-1',
    NAME: 'Расовые модификаторы параметров',
    DATA: {
      header: {
        value: [['Раса', 'Модификатор параметра', 'Желаемый класс']],
      },
      body: [
        ['Гном', '+2 Телосложение, –2 Сила', 'Бард'],
        ['Дварф', '+2 Телосложение, –2 Обаяние', 'Воин'],
        ['Полуорк', '+2 Сила, –2 Интеллект(*), -2 Обаяние', 'Варвар'],
        ['Полуэльф', 'Нет', 'Любой'],
        ['Халфлинг', '+2 Ловкость, -2 Сила', 'Вор'],
        ['Человек', 'Нет', 'Любой'],
        ['Эльф', '+2 Ловкость, -2 Телосложение', 'Маг'],
      ],
    },
    addition: [
      `*: Минимальный стартовый показатель Интеллект Полуорка
      3. Если модификатор снижает Интеллект до 1 или 2, его конечный счет всё равно будет 3.`,
    ],
  },
  {
    KEY: 'table 3-1',
    NAME: 'Таблица 3-1: Базовые бонусы спасбросков и атак',
    DATA: {
      header: {
        value: [
          [
            'Уровень класса',
            'Базовый бонус',
            'Базовый бонус',
            'Базовый бонус атак (Хороший)',
            'Базовый бонус атак (Средний)',
            'Базовый бонус атак (Плохой)',
          ],
        ],
      },
      body: [
        ['1', '+2', '+0', '+1', '+0', '+0'],
        ['2', '+3', '+0', '+2', '+1', '+1'],
        ['3', '+3', '+1', '+3', '+2', '+1'],
        ['4', '+4', '+1', '+4', '+3', '+2'],
        ['5', '+4', '+1', '+5', '+3', '+2'],
        ['6', '+5', '+2', '+6/+1', '+4', '+3'],
        ['7', '+5', '+2', '+7/+2', '+5', '+3'],
        ['8', '+6', '+2', '+8/+3', '+6/+1', '+4'],
        ['9', '+6', '+3', '+9/+4', '+6/+1', '+4'],
        ['10', '+7', '+3', '+10/+5', '+7/+2', '+5'],
        ['11', '+7', '+3', '+11/+6/+1', '+8/+3', '+5'],
        ['12', '+8', '+4', '+12/+7/+2', '+9/+4', '+6/+1'],
        ['13', '+8', '+4', '+13/+8/+3', '+9/+4', '+6/+1'],
        ['14', '+9', '+4', '+14/+9/+4', '+10/+5', '+7/+2'],
        ['15', '+9', '+5', '+15/+10/+5', '+11/+6/+1', '+7/+2'],
        ['16', '+10', '+5', '+16/+11/+6/+1', '+12/+7/+2', '+8/+3'],
        ['17', '+10', '+5', '+17/+12/+7/+2', '+12/+7/+2', '+8/+3'],
        ['18', '+11', '+6', '+18/+13/+8/+3', '+13/+8/+3', '+9/+4'],
        ['19', '+11', '+6', '+19/+14/+9/+4', '+14/+9/+4', '+9/+4'],
        ['20', '+12', '+6', '+20/+15/+10/+5', '+15/+10/+5', '+10/+5'],
      ],
    },
  },
  {
    KEY: 'table 3-2',
    NAME: 'Таблица 3-2: Опыт и преимущества зависящие от уровня',
    DATA: {
      header: {
        value: [
          [
            'Уровень персонажа',
            'Оп (опыт)',
            'Макс. кол-во рангов навыка класса',
            'Макс. кол-во рангов навыков смежных классов',
            'Отличит. черты',
            'Повышение параметра',
          ],
        ],
      },
      body: [
        ['1', '0', '4', '2', '1-й', '-'],
        ['2', '1 000', '5', '2 1/2', '-', '-'],
        ['3', '3 000', '6', '3', '2-й', '-'],
        ['4', '6 000', '7', '3 1/2', '-', '1-й'],
        ['5', '10 000', '8', '4', '-', '-'],
        ['6', '15 000', '9', '4 1/2', '3-й', '-'],
        ['7', '21 000', '10', '5', '-', '-'],
        ['8', '28 000', '11', '5 1/2', '-', '2-й'],
        ['9', '36 000', '12', '6', '4-й', '-'],
        ['10', '45 000', '13', '6 1/2', '-', '-'],
        ['11', '55 000', '14', '7', '-', '-'],
        ['12', '66 000', '15', '7 1/2', '5-й', '3-й'],
        ['13', '78 000', '16', '8', '-', '-'],
        ['14', '91 000', '17', '8 1/2', '-', '-'],
        ['15', '105 000', '18', '9', '6-й', '-'],
        ['16', '120 000', '19', '9 1/2', '-', '4-й'],
        ['17', '136 000', '20', '10', '-', '-'],
        ['18', '153 000', '21', '10 1/2', '7-й', '-'],
        ['19', '171 000', '22', '11', '-', '-'],
        ['20', '190 000', '23', '11 1/2', '-', '5-й'],
      ],
    },
  },
  {
    KEY: 'table 3-2.1',
    DATA: {
      header: {
        value: [['Тип КХП', 'Класс']],
      },
      body: [
        ['d4', 'Маг, Чародей'],
        ['d6', 'Бард, Вор'],
        ['d8', 'Друид, Жрец, Монах'],
        ['d10', 'Воин, Паладин, Рейнджер'],
        ['d12', 'Варвар'],
      ],
    },
  },
  {
    KEY: 'table 3-3',
    NAME: 'Таблица 3-3. Бард',
    DATA: {
      header: {
        isComposite: true,
        value: [
          [
            {
              attr: {
                rowSpan: 2,
              },
              value: 'Базовый уровень',
            },
            {
              attr: {
                rowSpan: 2,
              },
              value: 'Бонус Атаки',
            },
            {
              attr: {
                rowSpan: 2,
              },
              value: 'Спасбросок Стойкости',
            },
            {
              attr: {
                rowSpan: 2,
              },
              value: 'Спасбросок Рефлексов',
            },
            {
              attr: {
                rowSpan: 2,
              },
              value: 'Спасбросок Воли',
            },
            {
              attr: {
                rowSpan: 2,
              },
              value: 'Особое',
            },
            {
              attr: {
                colSpan: 7,
              },
              value: 'Заклинаний в день',
            },
          ],
          [
            {
              value: '0',
            },
            {
              value: '1',
            },
            {
              value: '2',
            },
            {
              value: '3',
            },
            {
              value: '4',
            },
            {
              value: '5',
            },
            {
              value: '6',
            },
          ],
        ],
      },
      // prettier-ignore
      body: [
        ['1', '+0', '+0', '+2', '+2', `Владение бардовскими музыкой и знаниями,
       противопесня, повысить отвагу +1, гипнотизирование`,             '2', '-', '-', '-', '-', '-', '-'],
        ['2', '+1', '+0', '+3', '+3', '',                               '3', '0', '-', '-', '-', '-', '-'],
        ['3', '+2', '+1', '+3', '+3', 'Повысить способности',           '3', '1', '-', '-', '-', '-', '-'],
        ['4', '+3', '+1', '+4', '+4', '',                               '3', '2', '0', '-', '-', '-', '-'],
        ['5', '+3', '+1', '+4', '+4', '',                               '3', '3', '1', '-', '-', '-', '-'],
        ['6', '+4', '+2', '+5', '+5', 'Внушение',                       '3', '3', '2', '-', '-', '-', '-'],
        ['7', '+5', '+2', '+5', '+5', '',                               '3', '3', '2', '0', '-', '-', '-'],
        ['8', '+6/+1', '+2', '+6', '+6', 'Повысить отвагу +2',          '3', '3', '3', '1', '-', '-', '-'],
        ['9', '+6/+1', '+3', '+6', '+6', 'Повысить боевой дух',         '3', '3', '3', '2', '-', '-', '-'],
        ['10', '+7/+2', '+3', '+7', '+7', '',                           '3', '3', '3', '2', '0', '-', '-'],
        ['11', '+8/+3', '+3', '+7', '+7', '',                           '3', '3', '3', '3', '1', '-', '-'],
        ['12', '+9/+4', '+4', '+8', '+8', 'Песнь свободы',              '3', '3', '3', '3', '2', '-', '-'],
        ['13', '+9/+4', '+4', '+8', '+8', '',                           '3', '3', '3', '3', '2', '0', '-'],
        ['14', '+10/+5', '+4', '+9', '+9', 'Повысить отвагу +3',        '4', '3', '3', '3', '3', '1', '-'],
        ['15', '+11/+6/+1', '+5', '+9', '+9', 'Повысить героизм',       '4', '4', '3', '3', '3', '2', '-'],
        ['16', '+12/+7/+2', '+5', '+10', '+10', '',                     '4', '4', '4', '3', '3', '2', '0'],
        ['17', '+12/+7/+2', '+5', '+10', '+10', '',                     '4', '4', '4', '4', '3', '3', '1'],
        ['18', '+13/+8/+3', '+6', '+11', '+11', 'Массовое Внушение',    '4', '4', '4', '4', '4', '3', '2'],
        ['19', '+14/+9/+4', '+6', '+11', '+11', '',                     '4', '4', '4', '4', '4', '4', '3'],
        ['20', '+15/+10/+5', '+6', '+12', '+12', 'Повысить отвагу +4',  '4', '4', '4', '4', '4', '4', '4'],
      ]
    },
  },
  {
    KEY: 'table 3-4',
    NAME: 'Таблица 3-4. Знаемыe Бардом Заклинания',
    DATA: {
      header: {
        isComposite: true,
        value: [
          [
            {
              attr: {
                rowSpan: 2,
              },
              value: 'Уровень',
            },
            {
              attr: {
                colSpan: 7,
              },
              value: 'Знаемые заклинания',
            },
          ],
          [
            {
              value: '0',
            },
            {
              value: '1',
            },
            {
              value: '2',
            },
            {
              value: '3',
            },
            {
              value: '4',
            },
            {
              value: '5',
            },
            {
              value: '6',
            },
          ],
        ],
      },
      // prettier-ignore
      body: [
        ['1', '4', '-', '-', '-', '-', '-', '-'],
        ['2', '5', '2(*)', '-', '-', '-', '-', '-'],
        ['3', '6', '3', '-', '-', '-', '-', '-'],
        ['4', '6', '3', '2(*)', '-', '-', '-', '-'],
        ['6', '6', '4', '3', '-', '-', '-', '-'],
        ['7', '6', '4', '3', '-', '-', '-', '-'],
        ['5', '6', '4', '4', '2(*)', '-', '-', '-'],
        ['8', '6', '4', '4', '3', '-', '-', '-'],
        ['9', '6', '4', '4', '3', '-', '-', '-'],
        ['10', '6', '4', '4', '4', '2(*)', '-', '-'],
        ['11', '6', '4', '4', '4', '3', '-', '-'],
        ['12', '6', '4', '4', '4', '3', '-', '-'],
        ['13', '6', '4', '4', '4', '4', '2(*)', '-'],
        ['14', '6', '4', '4', '4', '4', '3', '-'],
        ['15', '6', '4', '4', '4', '4', '3', '-'],
        ['16', '6', '5', '4', '4', '4', '4', '2(*)'],
        ['17', '6', '5', '5', '4', '4', '4', '3'],
        ['18', '6', '5', '5', '5', '4', '4', '3'],
        ['19', '6', '5', '5', '5', '5', '4', '4'],
        ['20', '6', '5', '5', '5', '5', '5', '4'],
      ]
    },
    addition: [
      `*: Считается что у Барда достаточно Обаяния чтобы иметь
      бонусные заклинания этого уровня.`,
    ],
  },
  {
    KEY: 'table 3-4-1',
    DATA: {
      header: {
        value: [['Класс Сложности', 'Тип Знания', 'Примеры']],
      },
      // prettier-ignore
      body: [
        ['10', `Общая информация доступная многим людям`,
            'Репутация местного мэра из-за его пьянства, общие слухи о таинственном могущественном месте'],
        ['20', `Малораспостранено, но доступно. Известны лишь нескольким людям в городе`,
            'Темное прошлое местного жреца, легенды о могущественном артефакте'],
        ['25', `Смутное, доступное лишь нескольким, тяжело узнать`,
            'Историю семьи какогото рыцаря, легенды о незначительном могущественном месте, магическом предмете'],
        ['30', `Чрезвычайно смутное, известное лишь единицам, возможно, было забыто тем, кто его знал, или знает, но не понимает ценности этого знания`,
            'Детская кличка могучего волшебника, легенды о маленьком незначительном магическом предмете'],
      ]
    },
  },
  {
    KEY: 'table 3-4-2',
    DATA: {
      header: {
        value: [['Навык', 'Ранги', 'Параметр', 'Доспех']],
      },
      // prettier-ignore
      body: [
        ['Актерство (струнные инструменты)',    '4', 'Обаяние',   '-'],
        ['Дипломатия',                          '4', 'Обаяние',   '-'],
        ['Искусство Магии',                     '4', 'Интеллект', '-'],
        ['Использование Магических Устройств',  '4', 'Обаяние',   '-'],
        ['Знание (люое одно)',                  '4', 'Интеллект', '-'],
        ['Маскировка',                          '4', 'Обаяние',   '-'],
        ['Прислушивание',                       '4', 'Мудрость',  '-'],
        ['Расшифровка',                         '4', 'Интеллект', '-'],
        ['Сбор информации',                     '4', 'Обаяние',   '-'],
        ['Ловкие Руки',                         '4', 'Ловкость',  '-1'],
      ]
    },
  },
  {
    KEY: 'table 3-5',
    NAME: 'Таблица 3-5: Варвар',
    DATA: {
      header: {
        value: [
          [
            'Базовый уровень',
            'Бонус Атаки',
            'Спасбросок Стойкости',
            'Спасбросок Рефлексов',
            'Спасбросок Воли',
            'Особое',
          ],
        ],
      },
      // prettier-ignore
      body: [
        ['1', '+1',               '+2',  '+0', '+0', 'Ярость 1/день; безграмотность, повышенное передвижение'],
        ['2', '+2',               '+3',  '+0', '+0', 'Сверхъестественное уворачивание'],
        ['3', '+3',               '+3',  '+1', '+1', 'Ощущение ловушек +1'],
        ['4', '+4',               '+4',  '+1', '+1', 'Ярость 2/день'],
        ['5', '+5',               '+4',  '+1', '+1', 'Улучшенное сверхъестественное уворачивание'],
        ['6', '+6/+1',            '+5',  '+2', '+2', 'Ощущение ловушек +2'],
        ['7', '+7/+2',            '+5',  '+2', '+2', 'Снижение повреждений 1/—'],
        ['8', '+8/+3',            '+6',  '+2', '+2', 'Ярость 3/день'],
        ['9', '+9/+4',            '+6',  '+3', '+3', 'Ощущение ловушек +3'],
        ['10', '+10/+5',          '+7',  '+3', '+3', 'Снижение повреждений 2/—'],
        ['11', '+11/+6/+1',       '+7',  '+3', '+3', 'Повышенная ярость'],
        ['12', '+12/+7/+2',       '+8',  '+4', '+4', 'Ярость 4/день, Ощущение ловушек +4'],
        ['13', '+13/+8/+3',       '+8',  '+4', '+4', 'Снижение повреждений 3/—'],
        ['14', '+14/+9/+4',       '+9',  '+4', '+4', 'Непробиваемая воля'],
        ['15', '+15/+10/+5',      '+9',  '+5', '+5', 'Ощущение ловушек +5'],
        ['16', '+16/+11/+6/+1',   '+10', '+5', '+5', 'Снижение повреждений 4/—, ярость 5/день'],
        ['17', '+17/+12/+7/+2',   '+10', '+5', '+5', 'Неутомимая ярость'],
        ['18', '+18/+13/+8/+3',   '+11', '+6', '+6', 'Ощущение ловушек +6'],
        ['19', '+19/+14/+9/+4',   '+11', '+6', '+6', 'Снижение повреждений 5/—'],
        ['20', '+20/+15/+10/+5',  '+12', '+6', '+6', 'Могучая ярость, ярость 6/день'],
      ]
    },
  },
  {
    KEY: 'table 3-5-1',
    DATA: {
      header: {
        value: [['Навык', 'Ранги', 'Параметр', 'Доспех']],
      },
      // prettier-ignore
      body: [
        ['Взбирание',           '4', 'Сила',      '-1'],
        ['Искусство Выживания', '4', 'Мудрость',  '-'],
        ['Прислушивание',       '4', 'Мудрость',  '-'],
        ['Прыжки',              '4', 'Сила',      '-1'],
        ['Плавание',            '4', 'Сила',      '-2'],
        ['Езда Верхом',         '4', 'Ловкость',  '-'],
        ['Запугивание',         '4', 'Обаяние',   '-'],
        ['Отслеживание (ск)',   '2', 'Мудрость',  '-'],
      ]
    },
    addition: [`*–1 за каждые 2,2 кг снаряжения`],
  },
  {
    KEY: 'table 3-6',
    NAME: 'Таблица 3-6: Воин',
    DATA: {
      header: {
        value: [
          [
            'Базовый Уровень',
            'Бонус Атаки',
            'Спасбросок Стойкости',
            'Спасбросок Рефлексов',
            'Спасбросок Воли',
            'Особое',
          ],
        ],
      },
      // prettier-ignore
      body: [
        ['1', '+1',               '+2',  '+0', '+0', 'Бонусная черта'],
        ['2', '+2',               '+3',  '+0', '+0', 'Бонусная черта'],
        ['3', '+3',               '+3',  '+1', '+1', ''],
        ['4', '+4',               '+4',  '+1', '+1', 'Бонусная черта'],
        ['5', '+5',               '+4',  '+1', '+1', ''],
        ['6', '+6/+1',            '+5',  '+2', '+2', 'Бонусная черта'],
        ['7', '+7/+2',            '+5',  '+2', '+2', ''],
        ['8', '+8/+3',            '+6',  '+2', '+2', 'Бонусная черта'],
        ['9', '+9/+4',            '+6',  '+3', '+3', ''],
        ['10', '+10/+5',          '+7',  '+3', '+3', 'Бонусная черта'],
        ['11', '+11/+6/+1',       '+7',  '+3', '+3', ''],
        ['12', '+12/+7/+2',       '+8',  '+4', '+4', 'Бонусная черта'],
        ['13', '+13/+8/+3',       '+8',  '+4', '+4', ''],
        ['14', '+14/+9/+4',       '+9',  '+4', '+4', 'Бонусная черта'],
        ['15', '+15/+10/+5',      '+9',  '+5', '+5', ''],
        ['16', '+16/+11/+6/+1',   '+10', '+5', '+5', 'Бонусная черта'],
        ['17', '+17/+12/+7/+2',   '+10', '+5', '+5', ''],
        ['18', '+18/+13/+8/+3',   '+11', '+6', '+6', 'Бонусная черта'],
        ['19', '+19/+14/+9/+4',   '+11', '+6', '+6', ''],
        ['20', '+20/+15/+10/+5',  '+12', '+6', '+6', 'Бонусная черта'],
      ]
    },
  },
  {
    KEY: 'table 3-6-1',
    DATA: {
      header: {
        value: [['Навык', 'Ранги', 'Параметр', 'Доспех']],
      },
      // prettier-ignore
      body: [
        ['Взбирание',           '4', 'Сила',       '-6'],
        ['Прыжки',              '4', 'Сила',       '-6'],
        ['Езда Верхом',         '4', 'Ловкость',   '-'],
        ['Плавание',            '4', 'Сила',       '-12'],
        ['Прислушивание (ск)',  '2', 'Мудрость',   '-'],
        ['Поиск (ск)',          '2', 'Интеллект',  '-'],
        ['Отслеживание (ск)',   '2', 'Мудрость',   '-'],
      ]
    },
  },
  {
    KEY: 'table 3-6-2',
    DATA: {
      header: {
        value: [['Навык', 'Ранги', 'Параметр', 'Доспех']],
      },
      // prettier-ignore
      body: [
        ['Взбирание',           '4', 'Сила',       '-4'],
        ['Прыжки',              '4', 'Сила',       '-4'],
        ['Езда Верхом',         '4', 'Ловкость',   '-'],
        ['Плавание',            '4', 'Сила',       '-8'],
        ['Запугивание',         '4', 'Обаяние',    '-'],
        ['Прислушивание (ск)',  '2', 'Мудрость',   '-'],
        ['Поиск (ск)',          '2', 'Интеллект',  '-'],
        ['Отслеживание (ск)',   '2', 'Мудрость',   '-'],
      ]
    },
  },
  {
    KEY: 'table 3-7',
    NAME: 'Таблица 3-7: Вор',
    DATA: {
      header: {
        value: [
          [
            'Уровень',
            'Бонус Атаки',
            'Спасбросок Стойкости',
            'Спасбросок Рефлексов',
            'Спасбросок Воли',
            'Особое',
          ],
        ],
      },
      // prettier-ignore
      body: [
        ['1', '+0',          '+0',  '+2',  '+0', 'Коварная атака +1d6, обнаружение ловушек'],
        ['2', '+1',          '+0',  '+3',  '+0', 'Уклонение'],
        ['3', '+2',          '+1',  '+3',  '+1', 'Коварная атака +2d6, ощущение ловушек +1'],
        ['4', '+3',          '+1',  '+4',  '+1', 'Сверхъестественное уворачивание'],
        ['5', '+3',          '+1',  '+4',  '+1', 'Коварная атака +3d6'],
        ['6', '+4',          '+2',  '+5',  '+2', 'Ощущение ловушек +2'],
        ['7', '+5',          '+2',  '+5',  '+2', 'Коварная атака +4d6'],
        ['8', '+6/+1',       '+2',  '+6',  '+2', 'Улучшенное сверхъестественное уворачивание'],
        ['9', '+6/+1',       '+3',  '+6',  '+3', 'Коварная атака +5d6'],
        ['10', '+7/+2',      '+3',  '+7',  '+3', 'Особая способность'],
        ['11', '+8/+3',      '+3',  '+7',  '+3', 'Коварная атака +6d6'],
        ['12', '+9/+4',      '+4',  '+8',  '+4', 'Ощущение ловушек +4'],
        ['13', '+9/+4',      '+4',  '+8',  '+4', 'Коварная атака +7d6, особая способность'],
        ['14', '+10/+5',     '+4',  '+9',  '+4', '-'],
        ['15', '+11/+6/+1',  '+5',  '+9',  '+5', 'Коварная атака +8d6, ощущение ловушек +5'],
        ['16', '+12/+7/+2',  '+5',  '+10', '+5', 'Особая способность'],
        ['17', '+12/+7/+2',  '+5',  '+10', '+5', 'Коварная атака +9d6'],
        ['18', '+13+8/+3',   '+6',  '+11', '+6', 'Ощущение ловушек +6'],
        ['19', '+14/+9/+4',  '+6',  '+11', '+6', 'Коварная атака +10d6, особая способность'],
        ['20', '+15/+10/+5', '+6',  '+12', '+6', '-'],
      ]
    },
  },
  {
    KEY: 'table 3-7-1',
    DATA: {
      header: {
        value: [['Навык', 'Ранги', 'Параметр', 'Доспех']],
      },
      // prettier-ignore
      body: [
        ['Бесшумное Передвижение',              '4', 'Ловкость',  '0'],
        ['Скрытность',                          '4', 'Ловкость',  '0'],
        ['Прислушивание',                       '4', 'Мудрость',  '-'],
        ['Поиск',                               '4', 'Интеллект', '-'],
        ['Сложные Устройства',                  '4', 'Интеллект', '-'],
        ['Использование Магических Устройств',  '4', 'Обаяние',   '-'],
        ['Отслеживание',                        '4', 'Мудрость',  '-'],
        ['Взлом Замка',                         '4', 'Ловкость',  '-'],
        ['Взбирание',                           '4', 'Сила',      '0'],
        ['Ловкие Руки',                         '4', 'Ловкость',  '0'],
        ['Раскодирование Шрифтов',              '4', 'Интеллект', '-'],
        ['Запугивание',                         '4', 'Обаяние',   '-'],
        ['Блеф',                                '4', 'Обаяние',   '-'],
      ]
    },
  },
  {
    KEY: 'table 3-8',
    NAME: 'Таблица 3-8: Друид',
    DATA: {
      header: {
        isComposite: true,
        value: [
          [
            {
              attr: {
                rowSpan: 2,
              },
              value: 'Уровень',
            },
            {
              attr: {
                rowSpan: 2,
              },
              value: 'Бонус Атаки',
            },
            {
              attr: {
                rowSpan: 2,
              },
              value: 'Спасбросок Стойкости',
            },
            {
              attr: {
                rowSpan: 2,
              },
              value: 'Спасбросок Рефлексов',
            },
            {
              attr: {
                rowSpan: 2,
              },
              value: 'Спасбросок Воли',
            },
            {
              attr: {
                rowSpan: 2,
              },
              value: 'Особое',
            },
            {
              attr: {
                colSpan: 10,
              },
              value: 'Заклинаний в день',
            },
          ],
          [
            {
              value: '0',
            },
            {
              value: '1',
            },
            {
              value: '2',
            },
            {
              value: '3',
            },
            {
              value: '4',
            },
            {
              value: '5',
            },
            {
              value: '6',
            },
            {
              value: '7',
            },
            {
              value: '8',
            },
            {
              value: '9',
            },
          ],
        ],
      },
      // prettier-ignore
      body: [
        ['1', '+0',         '+2', '+0', '+2',  `Чувство природы, животное спутник, дикая эмпатия`,      '3', '1', '-', '-', '-', '-', '-', '-', '-', '-'],
        ['2', '+1',         '+3', '+0', '+3',  'Передвижение по лесу',                                  '4', '2', '-', '-', '-', '-', '-', '-', '-', '-'],
        ['3', '+2',         '+3', '+1', '+3',  'Передвижение без следов',                               '4', '2', '1', '-', '-', '-', '-', '-', '-', '-'],
        ['4', '+3',         '+4', '+1', '+4',  'Устойчивость к соблазнам природы',                      '5', '3', '2', '-', '-', '-', '-', '-', '-', '-'],
        ['5', '+3',         '+4', '+1', '+4',  'Обращение в животное (1/день)',                         '5', '3', '2', '1', '-', '-', '-', '-', '-', '-'],
        ['6', '+4',         '+5', '+2', '+5',  'Обращение в животное (2/день)',                         '5', '3', '3', '2', '-', '-', '-', '-', '-', '-'],
        ['7', '+5',         '+5', '+2', '+5',  'Обращение в животное (3/день)',                         '6', '4', '3', '2', '1', '-', '-', '-', '-', '-'],
        ['8', '+6/+1',      '+6', '+2', '+6',  'Обращение в животное (Большое)',                        '6', '4', '3', '3', '2', '-', '-', '-', '-', '-'],
        ['9', '+6/+1',      '+6', '+3', '+6',  'Иммунитет к ядам',                                      '6', '4', '4', '3', '2', '1', '-', '-', '-', '-'],
        ['10', '+7/+2',     '+7', '+3', '+7',  'Обращение в животное (4/день)',                         '6', '4', '4', '3', '3', '2', '-', '-', '-', '-'],
        ['11', '+8/+3',     '+7', '+3', '+7',  'Обращение в животное (Крошечное)',                      '6', '5', '4', '4', '3', '2', '1', '-', '-', '-'],
        ['12', '+9/+4',     '+8', '+4', '+8',  'Обращение в животное (Растение)',                       '6', '5', '4', '4', '3', '3', '2', '-', '-', '-'],
        ['13', '+9/+4',     '+8', '+4', '+8',  'Тысячи лиц',                                            '6', '5', '5', '4', '4', '3', '2', '1', '-', '-'],
        ['14', '+10/+5',    '+9', '+4', '+9',  'Обращение в животное (5/день)',                         '6', '5', '5', '4', '4', '3', '3', '2', '-', '-'],
        ['15', '+11/+6/+1', '+9', '+5', '+9',  'Обращение в животное (Огромное), Вечное тело',          '6', '5', '5', '5', '4', '4', '3', '2', '1', '-'],
        ['16', '+12/+7/+2', '+10','+5', '+10', 'Обращение в элементаль (1/день)',                       '6', '5', '5', '5', '4', '4', '3', '3', '2', '-'],
        ['17', '+12/+7/+2', '+10','+5', '+10', '',                                                      '6', '5', '5', '5', '5', '4', '4', '3', '2', '1'],
        ['18', '+13/+8/+3', '+11','+6', '+11', 'Обращение в животное (6/день) элементаль (2/день)',     '6', '5', '5', '5', '5', '4', '4', '3', '3', '2'],
        ['19', '+14/+9/+4', '+11','+6', '+11', '',                                                      '6', '5', '5', '5', '5', '5', '4', '4', '3', '3'],
        ['20', '+15/+10/+5','+12','+6', '+12', 'Обращение в элементаль (3/день, Огромная элементаль)',  '6', '5', '5', '5', '5', '5', '4', '4', '4', '4'],
      ]
    },
  },
  {
    KEY: 'table 3-8-1',
    DATA: {
      header: {
        value: [
          [
            'Уровень Класса',
            'Бонусные КХП',
            'Природная Корр. Доспеха',
            'Корр. Сила/Ловк',
            'Доп. Трюки',
            'Особое',
          ],
        ],
      },
      // prettier-ignore
      body: [
        ['1-2',   '+0',  '+0',  '+0', '1', 'Связь, совместные заклинания'],
        ['3-5',   '+2',  '+2',  '+1', '2', 'Уклонение'],
        ['6-8',   '+4',  '+4',  '+2', '3', 'Преданность'],
        ['9-11',  '+6',  '+6',  '+3', '4', 'Мультиатака'],
        ['12-14', '+8',  '+8',  '+4', '5', ''],
        ['15-17', '+10', '+10', '+5', '6', 'Улучшенное уклонение'],
        ['18-20', '+12', '+12', '+6', '7', ''],
      ]
    },
  },
  {
    KEY: 'table 3-8-2',
    DATA: {
      header: {
        isComposite: true,
        value: [
          [
            {
              attr: {
                colSpan: 2,
              },
              value: '4-й Уровень и Выше (Уровень -3)',
            },
          ],
        ],
      },
      // prettier-ignore
      body: [
        ['Бизон (животное)',          'Крокодил (животное)'],
        ['Большая Акула* (животное)', 'Леопард (животное)'],
        ['Гепард (животное)',         'Росомаха (животное)'],
        ['Горилла (животное)',        'Удав (животное)'],
        ['Жуткий барсук (животное)',  'Черный медведь (животное)'],
        ['Жуткая ласка (животное)',   'Ядовитая змея (животное)'],
        ['Кабан (животное)',          'Ящер наблюдатель (животное)'],
      ]
    },
  },
  {
    KEY: 'table 3-8-3',
    DATA: {
      header: {
        isComposite: true,
        value: [
          [
            {
              attr: {
                colSpan: 2,
              },
              value: '7-й Уровень и Выше (Уровень -6)',
            },
          ],
        ],
      },
      // prettier-ignore
      body: [
        ['Бурый медведь (животное)',        'Жуткая росомаха'],
        ['Гигантский крокодил (животное)',  'Лев (животное)'],
        ['Дайноцихис (динозавр)',           'Носорог (животное)'],
        ['Жуткая горилла',                  'Огромная ядовитая змея (животное)'],
        ['Жуткий кабан',                    'Тигр (животное)'],
        ['Жуткий волк',                     'Эласмозавр* (динозавр)'],
      ]
    },
  },
  {
    KEY: 'table 3-8-4',
    DATA: {
      header: {
        isComposite: true,
        value: [
          [
            {
              attr: {
                colSpan: 2,
              },
              value: '10-й Уровень и Выше (Уровень -9)',
            },
          ],
        ],
      },
      // prettier-ignore
      body: [
        ['Белый медведь (животное)',        'Мегараптор (динозавр)'],
        ['Гигантский удав (животное)',      'Огромная акула* (животное)'],
        ['Жуткий лев',                      'Орка (китообразн. животное)'],
      ]
    },
  },
  {
    KEY: 'table 3-8-5',
    DATA: {
      header: {
        isComposite: true,
        value: [
          [
            {
              attr: {
                colSpan: 2,
              },
              value: '13-й Уровень и Выше (Уровень -12)',
            },
          ],
        ],
      },
      // prettier-ignore
      body: [
        ['Гигантский осьминог* (животное)', 'Слон (животное)'],
        ['Жуткий медведь',                  ''],
      ]
    },
  },
  {
    KEY: 'table 3-8-6',
    DATA: {
      header: {
        isComposite: true,
        value: [
          [
            {
              attr: {
                colSpan: 2,
              },
              value: '16-й Уровень и Выше (Уровень -15)',
            },
          ],
        ],
      },
      // prettier-ignore
      body: [
        ['Гигантский кальмар* (животное)',  'Тираннозавр (динозавр)'],
        ['Жуткая акула',                    'Трицератопс (динозавр)'],
        ['Жуткий тигр',                     ''],
      ]
    },
    addition: [`* Доступно только в водяной среде`],
  },
  {
    KEY: 'table 3-8-7',
    DATA: {
      header: {
        value: [['Навык', 'Ранги', 'Параметр', 'Доспех']],
      },
      // prettier-ignore
      body: [
        ['Искусство Магии',     '4', 'Интеллект',     '-'],
        ['Концентрация',        '4', 'Телосложение',  '-'],
        ['Искусство Выживания', '4', 'Мудрость',      '-'],
        ['Лечение',             '4', 'Мудрость',      '-'],
        ['Приручение Животных', '4', 'Обаяние',       '-'],
        ['Знание (природа)',    '4', 'Интеллект',     '-'],
        ['Прислушивание',       '4', 'Мудрость',      '-'],
        ['Отслеживание',        '4', 'Мудрость',      '-'],
      ]
    },
  },
  {
    KEY: 'table 3-9',
    NAME: 'Таблица 3-9: Жрец/Священник',
    DATA: {
      header: {
        isComposite: true,
        value: [
          [
            { value: 'Уровень', attr: { rowSpan: 2 } },
            { value: 'Бонус Атаки', attr: { rowSpan: 2 } },
            { value: 'Спасбросок Стойкости', attr: { rowSpan: 2 } },
            { value: 'Спасбросок Рефлексов', attr: { rowSpan: 2 } },
            { value: 'Спасбросок Воли', attr: { rowSpan: 2 } },
            { value: 'Особое', attr: { rowSpan: 2 } },
            { value: 'Заклинаний в день*', attr: { colSpan: 10 } },
          ],
          [
            { value: '0' },
            { value: '1' },
            { value: '2' },
            { value: '3' },
            { value: '4' },
            { value: '5' },
            { value: '6' },
            { value: '7' },
            { value: '8' },
            { value: '9' },
          ],
        ],
      },
      // prettier-ignore
      body:[
          ["1", "+0",          "+2", "+0", "+2", "Изгнание Нежити", "3", "1+1", "-", "-", "-", "-", "-", "-", "-", "-" ],
          ["2", "+1",          "+3", "+0", "+3", "",    "4", "2+1", "-", "-", "-", "-", "-", "-", "-", "-" ],
          ["3", "+2",          "+3", "+1", "+3", "", "4", "2+1", "1+1", "-", "-", "-", "-", "-", "-", "-" ],
          ["4", "+3",          "+4", "+1", "+4", "", "5", "3+1", "2+1", "-", "-", "-", "-", "-", "-", "-" ],
          ["5", "+3",          "+4", "+1", "+4", "", "5", "3+1", "2+1", "1+1", "-", "-", "-", "-", "-", "-" ],
          ["6", "+4",          "+5", "+2", "+5", "", "5", "3+1", "3+1", "2+1", "-", "-", "-", "-", "-", "-" ],
          ["7", "+5",          "+5", "+2", "+5", "", "6", "4+1", "3+1", "2+1", "1+1", "-", "-", "-", "-", "-" ],
          ["8", "+6/+1",       "+6", "+2", "+6", "", "6", "4+1", "3+1", "3+1", "2+1", "-", "-", "-", "-", "-" ],
          ["9", "+6/+1",       "+6", "+3", "+6", "", "6", "4+1", "4+1", "3+1", "2+1", "1+1", "-", "-", "-", "-" ],
          ["10", "+7/+2",      "+7", "+3", "+7", "", "6", "4+1", "4+1", "3+1", "3+1", "2+1", "-", "-", "-", "-" ],
          ["11", "+8/+3",      "+7", "+3", "+7", "", "6", "5+1", "4+1", "4+1", "3+1", "2+1", "1+1", "-", "-", "-" ],
          ["12", "+9/+4",      "+8", "+4", "+8", "", "6", "5+1", "4+1", "4+1", "3+1", "3+1", "2+1", "-", "-", "-" ],
          ["13", "+9/+4",      "+8", "+4", "+8", "", "6", "5+1", "5+1", "4+1", "4+1", "3+1", "2+1", "1+1", "-", "-" ],
          ["14", "+10/+5",     "+9", "+4", "+9", "", "6", "5+1", "5+1", "4+1", "4+1", "3+1", "3+1", "2+1", "-", "-" ],
          ["15", "+11/+6/+1",  "+9", "+5", "+9", "", "6", "5+1", "5+1", "5+1", "4+1", "4+1", "3+1", "2+1", "1+1", "-" ],
          ["16", "+12/+7/+2",  "+10", "+5", "+10", "", "6", "5+1", "5+1", "5+1", "4+1", "4+1", "3+1", "3+1", "2+1", "-" ],
          ["17", "+12/+7/+2",  "+10", "+5", "+10", "", "6", "5+1", "5+1", "5+1", "5+1", "4+1", "4+1", "3+1", "2+1", "1+1" ],
          ["18", "+13/+8/+3",  "+11", "+6", "+11", "", "6", "5+1", "5+1", "5+1", "5+1", "4+1", "4+1", "3+1", "3+1", "2+1" ],
          ["19", "+14/+9/+4",  "+11", "+6", "+11", "", "6", "5+1", "5+1", "5+1", "5+1", "5+1", "4+1", "4+1", "3+1", "3+1" ],
          ["20", "+15/+10/+5", "+12", "+6", "+12", "", "6", "5+1", "5+1", "5+1", "5+1", "5+1", "4+1", "4+1", "4+1", "4+1" ]
      ]
    },
    addition: [
      `* В дополнение к указанным заклинаниям в день, жрец получает, начиная
        с первого уровня, дополнительное заклинание из своей сферы, с 1-го по 9-й уровни.
        Это отображено в виде «+1». Они не суммируются. Эти заклинания идут помимо бонусных
        заклинаний по высокой Мудрости`,
    ],
  },
  {
    KEY: 'table 3-10',
    NAME: 'Таблица 3-10: Боги',
    DATA: {
      header: {
        value: [
          ['Боги', 'Мировоззрение', 'Основные Сферы', 'Типичные Последователи'],
        ],
      },
      // prettier-ignore
      body:[
        ["Хайрониус, бог доблести",           "ЗД", "Война, Добро, Закон", "Паладины, воины, монахи"],
        ["Морадин, бог дварфов",              "ЗД", "Добро, Земля, Закон, Защита", "Дварфы"],
        ["Йондалла, богиня халфлингов",       "ЗД", "Добро, Закон, Защита", "Халфлинги"],
        ["Эхлонна, богиня лесной местности",  "НД", "Добро, Животные, Растения, Солнце", "Эльфы, гномы, полуэльфы, халфлинги, рейнджеры, друиды."],
        ["Гарл Глиттергольд, бог гномов",     "НД", "Добро, Защита, Мошенничество", "Гномы"],
        ["Пелор, бог солнца",                 "НД", "Добро, Лечение, Сила, Солнце", "Рейнджеры, барды"],
        ["Кореллон Ларесйан, бог эльфов",     "ХД", "Война, Добро, Защита, Хаос", "Эльфы, полуэльфы, барды"],
        ["Корд, бог силы",                    "ХД", "Добро, Сила, Удача, Хаос", "Воины, варвары, воры, атлеты/спортсмены"],
        ["Вии Джас, богиня смерти, магии",    "ЗН", "Закон, Магия, Смерть", "Маги, некромансеры, чародеи"],
        ["Св. Кутберт, бог возмездия",        "ЗН", "Закон, Защита, Разрушения, Сила", "Воины, монахи, солдаты"],
        ["Боккоб, бог магии",                 "Н", "Знание, Магия, Мошенничество", "Маги, чародеи, ученые"],
        ["Фарлахнгун, бог дорог",             "Н", "Защита, Путешествие, Удача", "Барды, купцы, искатели приключений"],
        ["Обад-Хай, бог природы",             "Н", "Вода, Воздух, Животные, Земля, Растения, Огонь", "Друиды, варвары, рейнджеры"],
        ["Олидаммара, бог воров",             "ХН", "Мошенничество, Удача, Хаос", "Воры, барды, всяческие мошенники"],
        ["Хекстор, бог тирании",              "ЗЗ", "Война, Закон, Зло, Разрушения", "Злые воины и монахи"],
        ["Нерулл, бог смерти",                "НЗ", "Зло, Мошенничество, Смерть", "Злые некромансеры и воры"],
        ["Векна, бог тайн и секретов",        "НЗ", "Знание, Зло, Магия", "Злые маги и чародеи, воры и шпионы"],
        ["Эриснул, бог кровопролития",        "ХЗ", "Война, Зло, Мошенничество, Хаос", "Злые воины, варвары, воры"],
        ["Груумш, бог орков",                 "ХЗ", "Война, Зло, Сила, Хаос", "Полуорки, орки"]
      ]
    },
  },
  {
    KEY: 'table 3-10-1',
    DATA: {
      header: {
        value: [['Навык', 'Ранги', 'Параметр', 'Доспех']],
      },
      // prettier-ignore
      body: [
        ['Искусство Магии',       '4', 'Интеллект',     '-'],
        ['Концентрация',          '4', 'Телосложение',  '-'],
        ['Лечение',               '4', 'Мудрость',      '-'],
        ['Знание (религия)',      '4', 'Интеллект',     '-'],
        ['Дипломатия',            '4', 'Обаяние',     '-'],
        ['Сбор Информации (ск)',  '2', 'Обаяние',      '-'],
        ['Прислушивание (ск)',    '2', 'Мудрость',      '-'],
      ]
    },
  },
  {
    KEY: 'table 3-11',
    NAME: 'Таблица 3-11: Маг',
    DATA: {
      header: {
        isComposite: true,
        value: [
          [
            { value: 'Уровень', attr: { rowSpan: 2 } },
            { value: 'Бонус Атаки', attr: { rowSpan: 2 } },
            { value: 'Спасбросок Стойкости', attr: { rowSpan: 2 } },
            { value: 'Спасбросок Рефлексов', attr: { rowSpan: 2 } },
            { value: 'Спасбросок Воли', attr: { rowSpan: 2 } },
            { value: 'Особое', attr: { rowSpan: 2 } },
            { value: 'Заклинаний в день', attr: { colSpan: 10 } },
          ],
          [
            { value: '0' },
            { value: '1' },
            { value: '2' },
            { value: '3' },
            { value: '4' },
            { value: '5' },
            { value: '6' },
            { value: '7' },
            { value: '8' },
            { value: '9' },
          ],
        ],
      },
      // prettier-ignore
      body:[
          ["1", "+0",      "+0", "+0", "+2", "Призыв Талисмана, Написать Свиток", "3", "1", "-", "-", "-", "-", "-", "-", "-", "-" ],
          ["2", "+1",      "+0", "+0", "+3", "",                                  "4", "2", "-", "-", "-", "-", "-", "-", "-", "-" ],
          ["3", "+1",      "+1", "+1", "+3", "",                                  "4", "2", "1", "-", "-", "-", "-", "-", "-", "-" ],
          ["4", "+2",      "+1", "+1", "+4", "",                                  "4", "3", "2", "-", "-", "-", "-", "-", "-", "-" ],
          ["5", "+2",      "+1", "+1", "+4", "Бонусная черта",                    "4", "3", "2", "1", "-", "-", "-", "-", "-", "-" ],
          ["6", "+3",      "+2", "+2", "+5", "",                                  "4", "3", "3", "2", "-", "-", "-", "-", "-", "-" ],
          ["7", "+3",      "+2", "+2", "+5", "",                                  "4", "4", "3", "2", "1", "-", "-", "-", "-", "-" ],
          ["8", "+4",      "+2", "+2", "+6", "",                                  "4", "4", "3", "3", "2", "-", "-", "-", "-", "-" ],
          ["9", "+4",      "+3", "+3", "+6", "",                                  "4", "4", "4", "3", "2", "1", "-", "-", "-", "-" ],
          ["10", "+5",     "+3", "+3", "+7", "Бонусная черта",                    "4", "4", "4", "3", "3", "2", "-", "-", "-", "-" ],
          ["11", "+5",     "+3", "+3", "+7", "",                                  "4", "4", "4", "4", "3", "2", "1", "-", "-", "-" ],
          ["12", "+6/+1",  "+4", "+4", "+8", "",                                  "4", "4", "4", "4", "3", "3", "2", "-", "-", "-" ],
          ["13", "+6/+1",  "+4", "+4", "+8", "",                                  "4", "4", "4", "4", "4", "3", "2", "1", "-", "-" ],
          ["14", "+7/+2",  "+4", "+4", "+9", "",                                  "4", "4", "4", "4", "4", "3", "3", "2", "-", "-" ],
          ["15", "+7/+2",  "+5", "+5", "+9", "Бонусная черта",                    "4", "4", "4", "4", "4", "4", "3", "2", "1", "-" ],
          ["16", "+8/+3",  "+5", "+5", "+10", "",                                 "4", "4", "4", "4", "4", "4", "3", "3", "2", "-" ],
          ["17", "+8/+3",  "+5", "+5", "+10", "",                                 "4", "4", "4", "4", "4", "4", "4", "3", "2", "1" ],
          ["18", "+9/+4",  "+6", "+6", "+11", "",                                 "4", "4", "4", "4", "4", "4", "4", "3", "3", "2" ],
          ["19", "+9/+4",  "+6", "+6", "+11", "",                                 "4", "4", "4", "4", "4", "4", "4", "4", "3", "3" ],
          ["20", "+10/+5", "+6", "+6", "+12", "Бонусная черта",                   "4", "4", "4", "4", "4", "4", "4", "4", "4", "4" ]
      ]
    },
  },
  {
    KEY: 'table 3-11-1',
    DATA: {
      header: {
        value: [['Талисман', 'Особое']],
      },
      // prettier-ignore
      body: [
        ['Ворона*',     'У хозяина +3 бонус к Оценке'],
        ['Жаба',        'У хозяина +3 хит-поинта'],
        ['Змея**',      'У хозяина +3 бонус к Блефу'],
        ['Кошка',       'У хозяина +3 бонус к Бесшумному Передвижению'],
        ['Крыса',       'У хозяина +2 бонус к проверкам Стойкости'],
        ['Ласка',       'У хозяина +2 бонус к проверкам Рефлекса'],
        ['Летуч. Мышь', 'У хозяина +3 бонус к Прислушиванию'],
        ['Сова',        'У хозяина +3 бонус к Отслежив. в сумерках и ночью'],
        ['Ястреб',      'У хозяина +3 бонус к Отслежив. при дневн. свете'],
        ['Ящерица',     'У хозяина +3 бонус к Взбиранию'],
      ]
    },
    addition: [
      `* Талисман Ворона способен разговаривать на одном из языков по выбору
      хозяина как сверхъестественной способностью`,
      `** Крошечная ядовитая змея`,
    ],
  },
  {
    KEY: 'table 3-11-2',
    DATA: {
      header: {
        value: [
          [
            'Уровень Класса Хозяина',
            'Корр. Природного Доспеха',
            'Интеллект',
            'Особое',
          ],
        ],
      },
      // prettier-ignore
      body: [
        ['1-2',   '+1',  '6',  'Настороженность, улучшенное уклонение, совместные заклинания, эмпатическая связь'],
        ['3-4',   '+2',  '7',  'Перенос касательных заклинаний'],
        ['5-6',   '+3',  '8',  'Общение с хозяином'],
        ['7-8',   '+4',  '9',  'Общение с животными своего типа'],
        ['9-10',  '+5',  '10', '-'],
        ['11-12', '+6',  '11', 'Устойчивость к Магии'],
        ['13-14', '+7',  '12', 'Магическое слежение за талисманом'],
        ['15-16', '+8',  '13', '-'],
        ['17-18', '+9',  '14', '-'],
        ['19-20', '+10', '15', '-'],
      ]
    },
  },
  {
    KEY: 'table 3-12',
    NAME: 'Таблица 3-12: Монах',
    DATA: {
      header: {
        value: [
          [
            'Уровень',
            'Бонус Атаки',
            'Спасбросок Стойкости',
            'Спасбросок Рефлексов',
            'Спасбросок Воли',
            'Особое',
            'Бонус атаки Шквала ударов',
            'Невооруж. Поврежд.',
            'Бонус КД',
            'Скорость без Доспехов',
          ],
        ],
      },
      // prettier-ignore
      body: [
        ['1', '+0',          '+2',  '+2', '+2',   'Бонусная черта, шквал ударов, невооруженный удар',               '-2/-2',              '1d6', '+0', '+0 м.'],
        ['2', '+1',          '+3',  '+3', '+3',   'Бонусная черта, уклонение',                                      '-1/-1',              '1d6', '+0', '+0 м.'],
        ['3', '+2',          '+3',  '+3', '+3',   'Неподвижный Разум',                                              '+0/+0',              '1d6', '+0', '+3 м.'],
        ['4', '+3',          '+4',  '+4', '+4',   'Замедленное Падение (6 м.), Удар Ци',                            '+1/+1',              '1d8', '+0', '+3 м.'],
        ['5', '+3',          '+4',  '+4', '+4',   'Чистота тела',                                                   '+2/+2',              '1d8', '+1', '+3 м.'],
        ['6', '+4',          '+5',  '+5', '+5',   'Бонусная черта, замедленное Падение (9 м.)',                     '+3/+3',              '1d8', '+1', '+6 м.'],
        ['7', '+5',          '+5',  '+5', '+5',   'Целостность Тела',                                               '+4/+4',              '1d8', '+1', '+6 м.'],
        ['8', '+6/+1',       '+6',  '+6', '+6',   'Замедленное Падение (12м.)',                                     '+5/+5/+0',           '1d10', '+1', '+6 м.'],
        ['9', '+6/+1',       '+6',  '+6', '+6',   'Улучшенное Уклонение',                                           '+6/+6/+1',           '1d10', '+1', '+9 м.'],
        ['10', '+7/+2',      '+7',  '+7', '+7',   'Замедленное Падение (15 м.), удар Ци (законный)',                '+7/+7/+2',           '1d10', '+2', '+9 м.'],
        ['11', '+8/+3',      '+7',  '+7', '+7',   'Алмазное Тело, повышенный шквал',                                '+8/+8/+8/+3',        '1d10', '+2', '+9 м.'],
        ['12', '+9/+4',      '+8',  '+8', '+8',   'Замедленное Падение(18 м.), Поражающий Шаг',                     '+9/+9/+9/+4',        '2d6', '+2', '+12 м.'],
        ['13', '+9/+4',      '+8',  '+8', '+8',   'Алмазная душа',                                                  '+9/+9/+9/+4',        '2d6', '+2', '+12 м.'],
        ['14', '+10/+5',     '+9',  '+9', '+9',   'Замедленное Падение (21 м.)',                                    '+10/+10/+10/+5',     '2d6', '+2', '+12 м.'],
        ['15', '+11/+6/+1',  '+9',  '+9', '+9',   'Содрагающая Длань',                                              '+11/+11/+11/+6/+1',  '2d6', '+3', '+15 м.'],
        ['16', '+12/+7/+2',  '+10', '+10', '+10', 'Замедленное Падение (24 м.), Удар Ци (адамнтиновый)',            '+12/+12/+12/+7/+2',  '2d8', '+3', '+15 м.'],
        ['17', '+12/+7/+2',  '+10', '+10', '+10', 'Нестареющее Тело, Язык солнца и луны',                           '+12/+12/+12/+7/+2',  '2d8', '+3', '+15 м.'],
        ['18', '+13+8/+3',   '+11', '+11', '+11', 'Замедленное Падение (27 м.)',                                    '+13/+13/+13/+8/+3',  '2d8', '+3', '+18 м.'],
        ['19', '+14/+9/+4',  '+11', '+11', '+11', 'Пустота Тела',                                                   '+14/+14/+14/+9/+4',  '2d8', '+3', '+18 м.'],
        ['20', '+15/+10/+5', '+12', '+12', '+12', 'Замедленное Падение (любое расстояние), Собственное Улучшение',  '+15/+15/+15/+10/+5', '2d10', '+4', '+18 м.'],
      ]
    },
  },
  {
    KEY: 'table 3-13',
    NAME:
      'Таблица 3-13: Повреждение от Невооруженных Атак Маленьких и Больших Монахов',
    DATA: {
      header: {
        value: [
          ['Уровень', 'Повр. (Маленький Монах)', 'Повр. (Большой Монах)'],
        ],
      },
      // prettier-ignore
      body: [
        ['1-3',   '1d4', '1d8'],
        ['4-7',   '1d6', '2d6'],
        ['8-11',  '1d8', '2d8'],
        ['12-15', '1d10','3d6'],
        ['16-19', '2d6', '3d8'],
        ['20',    '2d8', '4d8'],
      ]
    },
  },
  {
    KEY: 'table 3-13-1',
    DATA: {
      header: {
        value: [['Навык', 'Ранги', 'Параметр', 'Доспех']],
      },
      // prettier-ignore
      body: [
        ['Прислушивание',           '4', 'Мудрость', '-'],
        ['Взбирание',               '4', 'Сила',     '0'],
        ['Бесшумное Передвижение',  '4', 'Ловкость', '0'],
        ['Падение/Кульбиты',        '4', 'Ловкость', '0'],
        ['Прыжки',                  '4', 'Сила',     '0'],
        ['Искусство Побега',        '4', 'Ловкость', '0'],
        ['Скрытность',              '4', 'Ловкость', '0'],
        ['Плавание',                '4', 'Сила',     '0'],
        ['Баланс',                  '4', 'Ловкость', '0'],
      ]
    },
  },
  {
    KEY: 'table 3-14',
    NAME: 'Таблица 3-14: Паладин',
    DATA: {
      header: {
        isComposite: true,
        value: [
          [
            { value: 'Уровень', attr: { rowSpan: 2 } },
            { value: 'Бонус Атаки', attr: { rowSpan: 2 } },
            { value: 'Спасбросок Стойкости', attr: { rowSpan: 2 } },
            { value: 'Спасбросок Рефлексов', attr: { rowSpan: 2 } },
            { value: 'Спасбросок Воли', attr: { rowSpan: 2 } },
            { value: 'Особое', attr: { rowSpan: 2 } },
            { value: 'Заклинаний в день', attr: { colSpan: 4 } },
          ],
          [{ value: '1' }, { value: '2' }, { value: '3' }, { value: '4' }],
        ],
      },
      // prettier-ignore
      body:[
          ["1", "+1",               "+2", "+0", "+0",   "Аура добра, обнаружение зла, поразить зло 1/день",   "-", "-", "-", "-"],
          ["2", "+2",               "+3", "+0", "+0",   "Излечивающее прикосновение, божественная изящность", "-", "-", "-", "-"],
          ["3", "+3",               "+3", "+1", "+1",   "Аура храбрости, божественное здоровье",              "-", "-", "-", "-"],
          ["4", "+4",               "+4", "+1", "+1",   "Изгнание нежити",                                    "0", "-", "-", "-"],
          ["5", "+5",               "+4", "+1", "+1",   "Необычный скакун, поразить зло 2/день",              "0", "-", "-", "-"],
          ["6", "+6/+1",            "+5", "+2", "+2",   "Излечение болезни 1/неделю",                         "1", "-", "-", "-"],
          ["7", "+7/+2",            "+5", "+2", "+2",   "",                                                   "1", "-", "-", "-"],
          ["8", "+8/+3",            "+6", "+2", "+2",   "",                                                   "1", "0", "-", "-"],
          ["9", "+9/+4",            "+6", "+3", "+3",   "Излечение болезни 2/неделю",                         "1", "0", "-", "-"],
          ["10", "+10/+5",          "+7", "+3", "+3",   "Поразить зло 3/день",                                "1", "1", "-", "-"],
          ["11", "+11/+6/+1",       "+7", "+3", "+3",   "",                                                   "1", "1", "0", "-"],
          ["12", "+12/+7/+2",       "+8", "+4", "+4",   "Излечение болезни 3/неделю ",                        "1", "1", "1", "-"],
          ["13", "+13/+8/+3",       "+8", "+4", "+4",   "",                                                   "1", "1", "1", "-"],
          ["14", "+14/+9/+4",       "+9", "+4", "+4",   "",                                                   "2", "1", "1", "0"],
          ["15", "+15/+10/+5",      "+9", "+5", "+5",   "Излечение болезни 4/неделю, поразить зло 4/день ",   "2", "1", "1", "1"],
          ["16", "+16/+11/+6/+1",   "+10", "+5", "+5",  "",                                                   "2", "2", "1", "1"],
          ["17", "+17/+12/+7/+2",   "+10", "+5", "+5",  "",                                                   "2", "2", "2", "1"],
          ["18", "+18/+13/+8/+3",   "+11", "+6", "+6",  "Излечение болезни 5/неделю ",                        "3", "2", "2", "1"],
          ["19", "+19/+14/+9/+4",   "+11", "+6", "+6",  "",                                                   "3", "3", "3", "2"],
          ["20", "+20/+15/+10/+5",  "+12", "+6", "+6",  "Поразить зло 5/день",                                "3", "3", "3", "3"]
      ]
    },
  },
  {
    KEY: 'table 3-14-1',
    DATA: {
      header: {
        value: [
          [
            'Уровень Паладина',
            'Бонус КХМ',
            'Корр. Природн. Доспех',
            'Корр. Силы',
            'Интл',
            'Особое',
          ],
        ],
      },
      // prettier-ignore
      body: [
        ['5-7',   '+2', '+4',   '+1', '6', 'Улучшенное уклонение, совместные заклинания, эмпатическая связь, совместные спасброски'],
        ['8-10',  '+4', '+4',   '+2', '7', 'Повышенная скорость'],
        ['11-14', '+6', '+8',   '+3', '8', 'Командование существами своего вида'],
        ['15-20', '+8', '+10',  '+4', '9', 'Устойчивость к Магии'],
      ]
    },
  },
  {
    KEY: 'table 3-14-2',
    DATA: {
      header: {
        value: [['Навык', 'Ранги', 'Параметр', 'Доспехи']],
      },
      // prettier-ignore
      body: [
        ['Лечение',             '4', 'Мудрость',  '-'],
        ['Езда Верхом',         '4', 'Ловкость',  '-'],
        ['Дипломатия',          '4', 'Обаяние',   '-'],
        ['Отслеживание (ск)',   '2', 'Мудрость',  '-'],
        ['Прислушивание (cк)',  '2', 'Мудрость',  '-'],
        ['Взбирание (cк)',      '2', 'Сила',      '-6'],
        ['Поиск (cк)',          '2', 'Интеллект', '-'],
      ]
    },
  },
  {
    KEY: 'table 3-15',
    NAME: 'Таблица 3-15: Рейнджер',
    DATA: {
      header: {
        isComposite: true,
        value: [
          [
            { value: 'Уровень', attr: { rowSpan: 2 } },
            { value: 'Бонус Атаки', attr: { rowSpan: 2 } },
            { value: 'Спасбросок Стойкости', attr: { rowSpan: 2 } },
            { value: 'Спасбросок Рефлексов', attr: { rowSpan: 2 } },
            { value: 'Спасбросок Воли', attr: { rowSpan: 2 } },
            { value: 'Особое', attr: { rowSpan: 2 } },
            { value: 'Заклинаний в день', attr: { colSpan: 4 } },
          ],
          [{ value: '1' }, { value: '2' }, { value: '3' }, { value: '4' }],
        ],
      },
      // prettier-ignore
      body:[
          ["1", "+1",               "+2",  "+2", "+0",   "Чтение следов, 1-й избранный враг",   "-", "-", "-", "-"],
          ["2", "+2",               "+3",  "+3", "+0",   "Стиль боя",                           "-", "-", "-", "-"],
          ["3", "+3",               "+3",  "+3", "+1",   "Выносливость",                        "-", "-", "-", "-"],
          ["4", "+4",               "+4",  "+4", "+1",   "Животное-спутник",                    "0", "-", "-", "-"],
          ["5", "+5",               "+4",  "+4", "+1",   "2-й избранный враг",                  "0", "-", "-", "-"],
          ["6", "+6/+1",            "+5",  "+5", "+2",   "Улучшенный стиль боя",                "1", "-", "-", "-"],
          ["7", "+7/+2",            "+5",  "+5", "+2",   "Лесное Продвижение",                  "1", "-", "-", "-"],
          ["8", "+8/+3",            "+6",  "+6", "+2",   "Быстрый Следопыт",                    "1", "0", "-", "-"],
          ["9", "+9/+4",            "+6",  "+6", "+3",   "Уворачивание",                        "1", "0", "-", "-"],
          ["10", "+10/+5",          "+7",  "+7", "+3",   "3-й избранный враг",                  "1", "1", "-", "-"],
          ["11", "+11/+6/+1",       "+7",  "+7", "+3",   "Мастерство боя",                      "1", "1", "0", "-"],
          ["12", "+12/+7/+2",       "+8",  "+8", "+4",   "",                                    "1", "1", "1", "-"],
          ["13", "+13/+8/+3",       "+8",  "+8", "+4",   "Камуфляж",                            "1", "1", "1", "-"],
          ["14", "+14/+9/+4",       "+9",  "+9", "+4",   "",                                    "2", "1", "1", "0"],
          ["15", "+15/+10/+5",      "+9",  "+9", "+5",   "4-й избранный враг",                  "2", "1", "1", "1"],
          ["16", "+16/+11/+6/+1",   "+10", "+10", "+5",  "",                                    "2", "2", "1", "1"],
          ["17", "+17/+12/+7/+2",   "+10", "+10", "+5",  "Скрытность в Поле Зрения",            "2", "2", "2", "1"],
          ["18", "+18/+13/+8/+3",   "+11", "+11", "+6",  "",                                    "3", "2", "2", "1"],
          ["19", "+19/+14/+9/+4",   "+11", "+11", "+6",  "",                                    "3", "3", "3", "2"],
          ["20", "+20/+15/+10/+5",  "+12", "+12", "+6",  "5-й избранный враг",                  "3", "3", "3", "3"]
      ]
    },
  },
  {
    KEY: 'table 3-16',
    NAME: 'Таблица 3-16: Избранные Враги Рейнжера',
    DATA: {
      header: {
        value: [['Тип (Подтип)', 'Примеры']],
      },
      // prettier-ignore
      body: [
        ['Великан',   'огр'],
        ['Внешний (воздушный)',       'стрелоястреб'],
        ['Внешний (водный)',          'тойанида'],
        ['Внешний (добрый)',          'ангел'],
        ['Внешний (законный)',        'формиан'],
        ['Внешний (земной)',          'ксорн'],
        ['Внешний (злой)',            'дьявол'],
        ['Внешний (местный)',         'тифлинг'],
        ['Внешний (огненный)',        'саламандра'],
        ['Внешний (хаотичный)',       'демон'],
        ['Гуманоид (водный)',         'русал'],
        ['Гуманоид (гоблиноид)',      'хобгоблин'],
        ['Гуманоид (гнолл)',          'гнолл'],
        ['Гуманоид (гном)',           'гном'],
        ['Гуманоид (дварф)',          'дварф'],
        ['Гуманоид (орк)',            'орк'],
        ['Гуманоид (рептилиевидный)', 'кобольд'],
        ['Гуманоид (человек)',        'человек'],
        ['Гуманоид (халфлинг)',       'халфлинг'],
        ['Гуманоид (эльф)',           'эльф'],
        ['Гуманоид (Дракон)',         'чёрный дракон'],
        ['Животное',                  'медведь'],
        ['Магический зверь',          'сместитель'],
        ['Механизм',                  'голем'],
        ['Насекомое',                 'ужасный паук'],
        ['Необычный',                 'бихолдер'],
        ['Нежить',                    'зомби'],
        ['Растение',                  'шаркающая куча'],
        ['Слизь',                     'желатиновый куб'],
        ['Фея',                       'дриада'],
        ['Элементаль',                'невидимый преследователь'],
      ]
    },
  },
  {
    KEY: 'table 3-16-1',
    DATA: {
      header: {
        value: [['Навык', 'Ранги', 'Параметр', 'Доспехи']],
      },
      // prettier-ignore
      body: [
        ['Искусство Выживания',     '4', 'Мудрость',  '-'],
        ['Скрытность',              '4', 'Ловкость',  '-1'],
        ['Бесшумное Передвижение',  '4', 'Мудрость',  '-1'],
        ['Прислушивание',           '4', 'Мудрость',  '-'],
        ['Отслеживание',            '4', 'Мудрость',  '-'],
        ['Знание (природа)',        '4', 'Мудрость',  '-'],
        ['Взбирание',               '4', 'Сила',      '-1'],
        ['Лечение',                 '4', 'Мудрость',  '-'],
        ['Плавание',                '4', 'Сила',      '-2'],
        ['Поиск',                   '4', 'Интеллект', '-'],
      ]
    },
  },
  {
    KEY: 'table 3-17',
    NAME: 'Таблица 3-17: Чародей',
    DATA: {
      header: {
        isComposite: true,
        value: [
          [
            { value: 'Уровень', attr: { rowSpan: 2 } },
            { value: 'Бонус Атаки', attr: { rowSpan: 2 } },
            { value: 'Спасбросок Стойкости', attr: { rowSpan: 2 } },
            { value: 'Спасбросок Рефлексов', attr: { rowSpan: 2 } },
            { value: 'Спасбросок Воли', attr: { rowSpan: 2 } },
            { value: 'Особое', attr: { rowSpan: 2 } },
            { value: 'Заклинаний в день', attr: { colSpan: 10 } },
          ],
          [
            { value: '0' },
            { value: '1' },
            { value: '2' },
            { value: '3' },
            { value: '4' },
            { value: '5' },
            { value: '6' },
            { value: '7' },
            { value: '8' },
            { value: '9' },
          ],
        ],
      },
      // prettier-ignore
      body:[
          ["1", "+0",      "+0", "+0", "+2", "Призыв Талисмана",                  "5", "3", "-", "-", "-", "-", "-", "-", "-", "-" ],
          ["2", "+1",      "+0", "+0", "+3", "",                                  "6", "4", "-", "-", "-", "-", "-", "-", "-", "-" ],
          ["3", "+1",      "+1", "+1", "+3", "",                                  "6", "5", "-", "-", "-", "-", "-", "-", "-", "-" ],
          ["4", "+2",      "+1", "+1", "+4", "",                                  "6", "6", "3", "-", "-", "-", "-", "-", "-", "-" ],
          ["5", "+2",      "+1", "+1", "+4", "",                                  "6", "6", "4", "-", "-", "-", "-", "-", "-", "-" ],
          ["6", "+3",      "+2", "+2", "+5", "",                                  "6", "6", "5", "3", "-", "-", "-", "-", "-", "-" ],
          ["7", "+3",      "+2", "+2", "+5", "",                                  "6", "6", "6", "4", "-", "-", "-", "-", "-", "-" ],
          ["8", "+4",      "+2", "+2", "+6", "",                                  "6", "6", "6", "5", "3", "-", "-", "-", "-", "-" ],
          ["9", "+4",      "+3", "+3", "+6", "",                                  "6", "6", "6", "6", "4", "-", "-", "-", "-", "-" ],
          ["10", "+5",     "+3", "+3", "+7", "",                                  "6", "6", "6", "6", "5", "3", "-", "-", "-", "-" ],
          ["11", "+5",     "+3", "+3", "+7", "",                                  "6", "6", "6", "6", "6", "4", "-", "-", "-", "-" ],
          ["12", "+6/+1",  "+4", "+4", "+8", "",                                  "6", "6", "6", "6", "6", "5", "3", "-", "-", "-" ],
          ["13", "+6/+1",  "+4", "+4", "+8", "",                                  "6", "6", "6", "6", "6", "6", "4", "-", "-", "-" ],
          ["14", "+7/+2",  "+4", "+4", "+9", "",                                  "6", "6", "6", "6", "6", "6", "5", "3", "-", "-" ],
          ["15", "+7/+2",  "+5", "+5", "+9", "",                                  "6", "6", "6", "6", "6", "6", "6", "4", "-", "-" ],
          ["16", "+8/+3",  "+5", "+5", "+10", "",                                 "6", "6", "6", "6", "6", "6", "6", "5", "3", "-" ],
          ["17", "+8/+3",  "+5", "+5", "+10", "",                                 "6", "6", "6", "6", "6", "6", "6", "6", "4", "-" ],
          ["18", "+9/+4",  "+6", "+6", "+11", "",                                 "6", "6", "6", "6", "6", "6", "6", "6", "5", "3" ],
          ["19", "+9/+4",  "+6", "+6", "+11", "",                                 "6", "6", "6", "6", "6", "6", "6", "6", "6", "4" ],
          ["20", "+10/+5", "+6", "+6", "+12", "",                                 "6", "6", "6", "6", "6", "6", "6", "6", "6", "6" ]
      ]
    },
  },
  {
    KEY: 'table 3-18',
    NAME: 'Таблица 3-18: Знаемые Чародеем Заклинания',
    DATA: {
      header: {
        isComposite: true,
        value: [
          [
            { value: 'Уровень', attr: { rowSpan: 2 } },
            { value: 'Количество Знаемых Заклинаний', attr: { colSpan: 10 } },
          ],
          [
            { value: '0' },
            { value: '1' },
            { value: '2' },
            { value: '3' },
            { value: '4' },
            { value: '5' },
            { value: '6' },
            { value: '7' },
            { value: '8' },
            { value: '9' },
          ],
        ],
      },
      // prettier-ignore
      body:[
          ["1",  "4", "2", "-", "-", "-", "-", "-", "-", "-", "-" ],
          ["2",  "5", "2", "-", "-", "-", "-", "-", "-", "-", "-" ],
          ["3",  "5", "3", "-", "-", "-", "-", "-", "-", "-", "-" ],
          ["4",  "6", "3", "1", "-", "-", "-", "-", "-", "-", "-" ],
          ["5",  "6", "4", "2", "-", "-", "-", "-", "-", "-", "-" ],
          ["6",  "7", "4", "2", "1", "-", "-", "-", "-", "-", "-" ],
          ["7",  "7", "5", "3", "2", "-", "-", "-", "-", "-", "-" ],
          ["8",  "8", "5", "3", "2", "1", "-", "-", "-", "-", "-" ],
          ["9",  "8", "5", "4", "3", "2", "-", "-", "-", "-", "-" ],
          ["10", "9", "5", "4", "3", "2", "1", "-", "-", "-", "-" ],
          ["11", "9", "5", "5", "4", "3", "2", "-", "-", "-", "-" ],
          ["12", "9", "5", "5", "4", "3", "2", "1", "-", "-", "-" ],
          ["13", "9", "5", "5", "4", "4", "3", "2", "-", "-", "-" ],
          ["14", "9", "5", "5", "4", "4", "3", "2", "1", "-", "-" ],
          ["15", "9", "5", "5", "4", "4", "4", "3", "2", "-", "-" ],
          ["16", "9", "5", "5", "4", "4", "4", "3", "2", "1", "-" ],
          ["17", "9", "5", "5", "4", "4", "4", "3", "3", "2", "-" ],
          ["18", "9", "5", "5", "4", "4", "4", "3", "3", "2", "1" ],
          ["19", "9", "5", "5", "4", "4", "4", "3", "3", "3", "2" ],
          ["20", "9", "5", "5", "4", "4", "4", "3", "3", "3", "3" ]
      ]
    },
  },
  {
    KEY: 'table 3-18-1',
    DATA: {
      header: {
        value: [['Навык', 'Ранги', 'Параметр', 'Доспехи']],
      },
      // prettier-ignore
      body: [
        ['Искусство Магии',             '4', 'Интеллект',     '-'],
        ['Концентрация',                '4', 'Телосложение',  '-'],
        ['Знание (магия)',              '4', 'Интеллект',     '-'],
        ['Блеф',                        '4', 'Обаяние',       '-'],
        ['Сбор Информации (ск)',        '2', 'Обаяние',       '-'],
        ['Дипломатия (ск)',             '2', 'Обаяние',       '-'],
        ['Скрытность (cк)',             '2', 'Ловкость',      '0'],
        ['Бесшумное Передвижение (cк)', '2', 'Ловкость',      '0'],
      ]
    },
  },
]
