// @flow
type defaultCellType = {
  isComposite?: false,
  value: Array<Array<string>>,
}

type compositeCellType = {
  isComposite: true,
  value: Array<Array<{ value: string, attr?: any }>>,
}

export type tableType = {
  KEY: string,
  NAME?: string,
  DATA: {
    header: compositeCellType | defaultCellType,
    body: any,
  },
  addition?: Array<string>,
}

export const TABLES: Array<tableType> = [
  {
    KEY: 'table 1-1',
    NAME: 'Таблица 1-1: Модификаторы параметров и бонусные заклинания',
    DATA: {
      header: {
        isComposite: true,
        value: [
          [
            {
              value: 'Показатель',
              attr: {
                rowSpan: 2,
              },
            },
            {
              value: 'Модификатор',
              attr: {
                rowSpan: 2,
              },
            },
            {
              value: 'Бонусные заклинания (По уровню заклинаний)',
              attr: {
                colSpan: 10,
              },
            },
          ],
          [
            { value: '0' },
            { value: '1' },
            { value: '2' },
            { value: '3' },
            { value: '4' },
            { value: '5' },
            { value: '6' },
            { value: '7' },
            { value: '8' },
            { value: '9' },
          ],
        ],
      },
      body: [
        ['1', '-5', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-'],
        ['2-3', '-4', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-'],
        ['4-5', '-3', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-'],
        ['6-7', '-2', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-'],
        ['8-9', '-1', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-'],
        ['10-11', '0', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-'],
        ['12-13', '+1', '1', '-', '-', '-', '-', '-', '-', '-', '-', '-'],
        ['14-15', '+2', '1', '1', '-', '-', '-', '-', '-', '-', '-', '-'],
        ['16-17', '+3', '1', '1', '1', '-', '-', '-', '-', '-', '-', '-'],
        ['18-19', '+4', '1', '1', '1', '1', '-', '-', '-', '-', '-', '-'],
        ['20-21', '+5', '2', '1', '1', '1', '1', '-', '-', '-', '-', '-'],
        ['22-23', '+6', '2', '2', '1', '1', '1', '1', '-', '-', '-', '-'],
        ['24-25', '+7', '2', '2', '2', '1', '1', '1', '1', '-', '-', '-'],
        ['26-27', '+8', '2', '2', '2', '2', '1', '1', '1', '1', '-', '-'],
        ['28-29', '+9', '3', '2', '2', '2', '2', '1', '1', '1', '1', '-'],
        ['30-31', '+10', '3', '3', '2', '2', '2', '2', '1', '1', '1', '1'],
      ],
    },
  },
  {
    KEY: 'table 1-2',
    NAME: 'Средние Показатели Силы',
    DATA: {
      header: {
        value: [['Раса или Существо', 'Средняя Сила', 'Средний Модификатор']],
      },
      body: [
        ['Аллип, волшебный огонек, тень', '-', '-'],
        ['Архон светлячок, летучая мышь, жаба', '1', '-5'],
        ['Рой крыс', '2', '-4'],
        ['Жужжала, крошечный ужасный паук, обезьяна', '3', '-4'],
        ['Григ, маленькая ужасная сороконожка', '4-5', '-3'],
        ['Кокатрис, пикси, ястреб', '6-7', '-2'],
        ['Квазит, барсук', '8-9', '-1'],
        ['Человек, бихолдер, жуткая крыса', '10-11', '+0'],
        ['Майнд флаер, собака, пони, упырь', '12-13', '+1'],
        ['Гнолл, жуткий барсук, бабуин, скат', '14-15', '+2'],
        ['Черный пудинг, чокер, Большая акула', '16-17', '+3'],
        ['Кентавр, минотавр, сместитель', '18-19', '+4'],
        ['Горилла, голем из плоти, горгона, огр', '20-21', '+5'],
        ['Огненный великан, трицератопс, слон', '30-31', '+10'],
        ['Великий вирм золотого дракона', '46-47', '+18'],
      ],
    },
  },
  {
    KEY: 'table 1-3',
    NAME: 'Средние Показатели Ловкости',
    DATA: {
      header: {
        value: [
          ['Раса или Существо', 'Средняя Ловкость', 'Средний Модификатор'],
        ],
      },
      body: [
        ['Визгун (гриб)', '-', '-'],
        ['Желатиновый куб (слизь)', '1', '-5'],
        ['Колоссальный оживленный объект', '4-5', '-3'],
        ['Зомби огра, пурпурный червь', '6-7', '-2'],
        ['Василиск, огненный великан, огр, тендрикулюс', '8-9', '-1'],
        ['Гигантский огненный жук, кабан, тритон, человек', '10-11', '+0'],
        ['Ламмасу, медвежатник, хобгоблин', '12-13', '+1'],
        ['Гиерасфинкс, сместитель', '14-15', '+2'],
        ['Лев, мерцающая собака, призрак, осьминог', '16-17', '+3'],
        ['Астральная дева (ангел), эфирный похититель', '18-19', '+4'],
        ['Костяной дьявол, стрелоястреб', '20-21', '+5'],
        ['Старейшая воздушная элементаль', '32-33', '+11'],
      ],
    },
  },
  {
    KEY: 'table 1-4',
    NAME: 'Средние Показатели Телосложения',
    DATA: {
      header: {
        value: [
          ['Раса или Существо', 'Среднee Телосложениe', 'Средний Модификатор'],
        ],
      },
      body: [
        ['Мумия, тень, упырь', '-', '-'],
        ['Рой саранчи, рой сороконожек', '8-9', '-1'],
        ['Бес, грик, жуткая ласка, человек', '10-11', '+0'],
        ['Медуза, нимфа, отидж, ржавочудище', '12-13', '+1'],
        ['Легкая лошадь, русал, троглодит', '14-15', '+2'],
        ['Подлая лоза, тигр, химера', '16-17', '+3'],
        ['Белый медведь, горгулья, умбер халк', '18-19', '+4'],
        ['Аболет, слон, тираннозавр', '20-21', '+5'],
        ['Тарраскью', '35', '+12'],
      ],
    },
  },
  {
    KEY: 'table 1-5',
    NAME: 'Средние Показатели Интеллекта',
    DATA: {
      header: {
        value: [
          ['Раса или Существо', 'Средний Интеллект', 'Средний Модификатор'],
        ],
      },
      body: [
        ['Голем, зомби, охровое желе', '-', '-'],
        ['Верблюд, карабкающийся падальщик, пурпурный червь', '1', '-5'],
        ['Гидра, лошадь, собака, тигр', '2', '-4'],
        ['Серый рендер, раст, тендрикулюс', '3', '-4'],
        ['Грифон, отидж, сместитель', '4-5', '-3'],
        ['Адская гончая, йарфак, огр, тролль', '6-7', '-2'],
        ['Гнолл, кентавр, троглодит', '8-9', '-1'],
        ['Вайт, ночная ведьма, медвежатник, человек', '10-11', '+0'],
        ['Дракочерепаха, ламия, облачный великан', '12-13', '+1'],
        ['Волшебный огонек, невидимый преследователь, призрак', '14-15', '+2'],
        ['Архон триумфатор, бихолдер, суккубус', '16-17', '+3'],
        ['Майнд флаер, ночное крыло, смертельный слаад', '18-19', '+4'],
        ['Кракен, ночной подкрадыватель, титан', '20-21', '+5'],
        ['Великий вирм золотого дракона', '32-33', '+11'],
      ],
    },
  },
  {
    KEY: 'table 1-6',
    NAME: 'Средние Показатели Мудрости',
    DATA: {
      header: {
        value: [
          ['Раса или Существо', 'Средняя Мудрость', 'Средний Модификатор'],
        ],
      },
      body: [
        ['Желатиновый куб (слизь), оживленный объект', '1', '-5'],
        ['Визгун (гриб)', '2', '-4'],
        ['Гизьянка, красный слаад', '6-7', '-2'],
        ['Гримлок, пурпурный червь, тролль', '8-9', '-1'],
        ['Людоящер, призрачный гриб, человек', '10-11', '+0'],
        ['Гиена, реморхаз, совомедведь, тень', '12-13', '+1'],
        ['Гигантский богомол, призрак, сова', '14-15', '+2'],
        ['Андросфинкс, лилленд, поглотитель', '16-17', '+3'],
        ['Коатль, нага страж, эриньез (дьявол)', '18-19', '+4'],
        ['Единорог, штормовой великан', '20-21', '+5'],
        ['Великий вирм золотого дракона', '32-33', '+11'],
      ],
    },
  },
  {
    KEY: 'table 1-7',
    NAME: 'Средние Показатели Обаяния',
    DATA: {
      header: {
        value: [
          ['Раса или Существо', 'Среднее Обаяние', 'Средний Модификатор'],
        ],
      },
      body: [
        ['Визгун (гриб), голем, зомби', '1', '-5'],
        ['Крокодил, носорог, паук, ящерица', '2', '-4'],
        ['Осьминог, тендрикулюс', '3', '-4'],
        ['Жуткая крыса, ласка, осел, чуул', '4-5', '-3'],
        ['Барсук, гигантский огненный жук, медведь, тролль', '6-7', '-2'],
        ['Гнолл, горгона, жуткий кабан, мантикора', '8-9', '-1'],
        ['Дретч (демон), росомаха, человек', '10-11', '+0'],
        ['Доппельгангер, ночная ведьма, подсекатель, триант', '12-13', '+1'],
        ['Барджест, медуза, штормовой великан', '14-15', '+2'],
        ['Ахайрай, гарпия, огр маг, пикси', '16-17', '+3'],
        ['Великий барджест, никси', '18-19', '+4'],
        ['Астральная дева (ангел), кракен', '20-21', '+5'],
        ['Великий вирм золотого дракона', '30-31', '+11'],
      ],
    },
  },
  {
    KEY: 'table 2-1',
    NAME: 'Расовые модификаторы параметров',
    DATA: {
      header: {
        value: [['Раса', 'Модификатор параметра', 'Желаемый класс']],
      },
      body: [
        ['Гном', '+2 Телосложение, –2 Сила', 'Бард'],
        ['Дварф', '+2 Телосложение, –2 Обаяние', 'Воин'],
        ['Полуорк', '+2 Сила, –2 Интеллект(*), -2 Обаяние', 'Варвар'],
        ['Полуэльф', 'Нет', 'Любой'],
        ['Халфлинг', '+2 Ловкость, -2 Сила', 'Вор'],
        ['Человек', 'Нет', 'Любой'],
        ['Эльф', '+2 Ловкость, -2 Телосложение', 'Маг'],
      ],
    },
    addition: [
      `*: Минимальный стартовый показатель Интеллект Полуорка
      3. Если модификатор снижает Интеллект до 1 или 2, его конечный счет всё равно будет 3.`,
    ],
  },
  {
    KEY: 'table 3-1',
    NAME: 'Таблица 3-1: Базовые бонусы спасбросков и атак',
    DATA: {
      header: {
        value: [
          [
            'Уровень класса',
            'Базовый бонус',
            'Базовый бонус',
            'Базовый бонус атак (Хороший)',
            'Базовый бонус атак (Средний)',
            'Базовый бонус атак (Плохой)',
          ],
        ],
      },
      body: [
        ['1', '+2', '+0', '+1', '+0', '+0'],
        ['2', '+3', '+0', '+2', '+1', '+1'],
        ['3', '+3', '+1', '+3', '+2', '+1'],
        ['4', '+4', '+1', '+4', '+3', '+2'],
        ['5', '+4', '+1', '+5', '+3', '+2'],
        ['6', '+5', '+2', '+6/+1', '+4', '+3'],
        ['7', '+5', '+2', '+7/+2', '+5', '+3'],
        ['8', '+6', '+2', '+8/+3', '+6/+1', '+4'],
        ['9', '+6', '+3', '+9/+4', '+6/+1', '+4'],
        ['10', '+7', '+3', '+10/+5', '+7/+2', '+5'],
        ['11', '+7', '+3', '+11/+6/+1', '+8/+3', '+5'],
        ['12', '+8', '+4', '+12/+7/+2', '+9/+4', '+6/+1'],
        ['13', '+8', '+4', '+13/+8/+3', '+9/+4', '+6/+1'],
        ['14', '+9', '+4', '+14/+9/+4', '+10/+5', '+7/+2'],
        ['15', '+9', '+5', '+15/+10/+5', '+11/+6/+1', '+7/+2'],
        ['16', '+10', '+5', '+16/+11/+6/+1', '+12/+7/+2', '+8/+3'],
        ['17', '+10', '+5', '+17/+12/+7/+2', '+12/+7/+2', '+8/+3'],
        ['18', '+11', '+6', '+18/+13/+8/+3', '+13/+8/+3', '+9/+4'],
        ['19', '+11', '+6', '+19/+14/+9/+4', '+14/+9/+4', '+9/+4'],
        ['20', '+12', '+6', '+20/+15/+10/+5', '+15/+10/+5', '+10/+5'],
      ],
    },
  },
  {
    KEY: 'table 3-2',
    NAME: 'Таблица 3-2: Опыт и преимущества зависящие от уровня',
    DATA: {
      header: {
        value: [
          [
            'Уровень персонажа',
            'Оп (опыт)',
            'Макс. кол-во рангов навыка класса',
            'Макс. кол-во рангов навыков смежных классов',
            'Отличит. черты',
            'Повышение параметра',
          ],
        ],
      },
      body: [
        ['1', '0', '4', '2', '1-й', '-'],
        ['2', '1 000', '5', '2 1/2', '-', '-'],
        ['3', '3 000', '6', '3', '2-й', '-'],
        ['4', '6 000', '7', '3 1/2', '-', '1-й'],
        ['5', '10 000', '8', '4', '-', '-'],
        ['6', '15 000', '9', '4 1/2', '3-й', '-'],
        ['7', '21 000', '10', '5', '-', '-'],
        ['8', '28 000', '11', '5 1/2', '-', '2-й'],
        ['9', '36 000', '12', '6', '4-й', '-'],
        ['10', '45 000', '13', '6 1/2', '-', '-'],
        ['11', '55 000', '14', '7', '-', '-'],
        ['12', '66 000', '15', '7 1/2', '5-й', '3-й'],
        ['13', '78 000', '16', '8', '-', '-'],
        ['14', '91 000', '17', '8 1/2', '-', '-'],
        ['15', '105 000', '18', '9', '6-й', '-'],
        ['16', '120 000', '19', '9 1/2', '-', '4-й'],
        ['17', '136 000', '20', '10', '-', '-'],
        ['18', '153 000', '21', '10 1/2', '7-й', '-'],
        ['19', '171 000', '22', '11', '-', '-'],
        ['20', '190 000', '23', '11 1/2', '-', '5-й'],
      ],
    },
  },
  {
    KEY: 'table 3-2.1',
    DATA: {
      header: {
        value: [['Тип КХП', 'Класс']],
      },
      body: [
        ['d4', 'Маг, Чародей'],
        ['d6', 'Бард, Вор'],
        ['d8', 'Друид, Жрец, Монах'],
        ['d10', 'Воин, Паладин, Рейнджер'],
        ['d12', 'Варвар'],
      ],
    },
  },
  {
    KEY: 'table 3-3',
    NAME: 'Таблица 3-3. Бард',
    DATA: {
      header: {
        isComposite: true,
        value: [
          [
            {
              attr: {
                rowSpan: 2,
              },
              value: 'Базовый уровень',
            },
            {
              attr: {
                rowSpan: 2,
              },
              value: 'Бонус Атаки',
            },
            {
              attr: {
                rowSpan: 2,
              },
              value: 'Спасбросок Стойкости',
            },
            {
              attr: {
                rowSpan: 2,
              },
              value: 'Спасбросок Рефлексов',
            },
            {
              attr: {
                rowSpan: 2,
              },
              value: 'Спасбросок Воли',
            },
            {
              attr: {
                rowSpan: 2,
              },
              value: 'Особое',
            },
            {
              attr: {
                colSpan: 7,
              },
              value: 'Заклинаний в день',
            },
          ],
          [
            {
              value: '0',
            },
            {
              value: '1',
            },
            {
              value: '2',
            },
            {
              value: '3',
            },
            {
              value: '4',
            },
            {
              value: '5',
            },
            {
              value: '6',
            },
          ],
        ],
      },
      // prettier-ignore
      body: [
        ['1', '+0', '+0', '+2', '+2', `Владение бардовскими музыкой и знаниями,
       противопесня, повысить отвагу +1, гипнотизирование`,             '2', '-', '-', '-', '-', '-', '-'],
        ['2', '+1', '+0', '+3', '+3', '',                               '3', '0', '-', '-', '-', '-', '-'],
        ['3', '+2', '+1', '+3', '+3', 'Повысить способности',           '3', '1', '-', '-', '-', '-', '-'],
        ['4', '+3', '+1', '+4', '+4', '',                               '3', '2', '0', '-', '-', '-', '-'],
        ['5', '+3', '+1', '+4', '+4', '',                               '3', '3', '1', '-', '-', '-', '-'],
        ['6', '+4', '+2', '+5', '+5', 'Внушение',                       '3', '3', '2', '-', '-', '-', '-'],
        ['7', '+5', '+2', '+5', '+5', '',                               '3', '3', '2', '0', '-', '-', '-'],
        ['8', '+6/+1', '+2', '+6', '+6', 'Повысить отвагу +2',          '3', '3', '3', '1', '-', '-', '-'],
        ['9', '+6/+1', '+3', '+6', '+6', 'Повысить боевой дух',         '3', '3', '3', '2', '-', '-', '-'],
        ['10', '+7/+2', '+3', '+7', '+7', '',                           '3', '3', '3', '2', '0', '-', '-'],
        ['11', '+8/+3', '+3', '+7', '+7', '',                           '3', '3', '3', '3', '1', '-', '-'],
        ['12', '+9/+4', '+4', '+8', '+8', 'Песнь свободы',              '3', '3', '3', '3', '2', '-', '-'],
        ['13', '+9/+4', '+4', '+8', '+8', '',                           '3', '3', '3', '3', '2', '0', '-'],
        ['14', '+10/+5', '+4', '+9', '+9', 'Повысить отвагу +3',        '4', '3', '3', '3', '3', '1', '-'],
        ['15', '+11/+6/+1', '+5', '+9', '+9', 'Повысить героизм',       '4', '4', '3', '3', '3', '2', '-'],
        ['16', '+12/+7/+2', '+5', '+10', '+10', '',                     '4', '4', '4', '3', '3', '2', '0'],
        ['17', '+12/+7/+2', '+5', '+10', '+10', '',                     '4', '4', '4', '4', '3', '3', '1'],
        ['18', '+13/+8/+3', '+6', '+11', '+11', 'Массовое Внушение',    '4', '4', '4', '4', '4', '3', '2'],
        ['19', '+14/+9/+4', '+6', '+11', '+11', '',                     '4', '4', '4', '4', '4', '4', '3'],
        ['20', '+15/+10/+5', '+6', '+12', '+12', 'Повысить отвагу +4',  '4', '4', '4', '4', '4', '4', '4'],
      ]
    },
  },
  {
    KEY: 'table 3-4',
    NAME: 'Таблица 3-4. Знаемыe Бардом Заклинания',
    DATA: {
      header: {
        isComposite: true,
        value: [
          [
            {
              attr: {
                rowSpan: 2,
              },
              value: 'Уровень',
            },
            {
              attr: {
                colSpan: 7,
              },
              value: 'Знаемые заклинания',
            },
          ],
          [
            {
              value: '0',
            },
            {
              value: '1',
            },
            {
              value: '2',
            },
            {
              value: '3',
            },
            {
              value: '4',
            },
            {
              value: '5',
            },
            {
              value: '6',
            },
          ],
        ],
      },
      // prettier-ignore
      body: [
        ['1', '4', '-', '-', '-', '-', '-', '-'],
        ['2', '5', '2(*)', '-', '-', '-', '-', '-'],
        ['3', '6', '3', '-', '-', '-', '-', '-'],
        ['4', '6', '3', '2(*)', '-', '-', '-', '-'],
        ['6', '6', '4', '3', '-', '-', '-', '-'],
        ['7', '6', '4', '3', '-', '-', '-', '-'],
        ['5', '6', '4', '4', '2(*)', '-', '-', '-'],
        ['8', '6', '4', '4', '3', '-', '-', '-'],
        ['9', '6', '4', '4', '3', '-', '-', '-'],
        ['10', '6', '4', '4', '4', '2(*)', '-', '-'],
        ['11', '6', '4', '4', '4', '3', '-', '-'],
        ['12', '6', '4', '4', '4', '3', '-', '-'],
        ['13', '6', '4', '4', '4', '4', '2(*)', '-'],
        ['14', '6', '4', '4', '4', '4', '3', '-'],
        ['15', '6', '4', '4', '4', '4', '3', '-'],
        ['16', '6', '5', '4', '4', '4', '4', '2(*)'],
        ['17', '6', '5', '5', '4', '4', '4', '3'],
        ['18', '6', '5', '5', '5', '4', '4', '3'],
        ['19', '6', '5', '5', '5', '5', '4', '4'],
        ['20', '6', '5', '5', '5', '5', '5', '4'],
      ]
    },
    addition: [
      `*: Считается что у Барда достаточно Обаяния чтобы иметь
      бонусные заклинания этого уровня.`,
    ],
  },
  {
    KEY: 'table 3-4-1',
    DATA: {
      header: {
        value: [['Класс Сложности', 'Тип Знания', 'Примеры']],
      },
      // prettier-ignore
      body: [
        ['10', `Общая информация доступная многим людям`,
            'Репутация местного мэра из-за его пьянства, общие слухи о таинственном могущественном месте'],
        ['20', `Малораспостранено, но доступно. Известны лишь нескольким людям в городе`,
            'Темное прошлое местного жреца, легенды о могущественном артефакте'],
        ['25', `Смутное, доступное лишь нескольким, тяжело узнать`,
            'Историю семьи какогото рыцаря, легенды о незначительном могущественном месте, магическом предмете'],
        ['30', `Чрезвычайно смутное, известное лишь единицам, возможно, было забыто тем, кто его знал, или знает, но не понимает ценности этого знания`,
            'Детская кличка могучего волшебника, легенды о маленьком незначительном магическом предмете'],
      ]
    },
  },
  {
    KEY: 'table 3-4-2',
    DATA: {
      header: {
        value: [['Навык', 'Ранги', 'Параметр', 'Доспех']],
      },
      // prettier-ignore
      body: [
        ['Актерство (струнные инструменты)',    '4', 'Обаяние',   '-'],
        ['Дипломатия',                          '4', 'Обаяние',   '-'],
        ['Искусство Магии',                     '4', 'Интеллект', '-'],
        ['Использование Магических Устройств',  '4', 'Обаяние',   '-'],
        ['Знание (люое одно)',                  '4', 'Интеллект', '-'],
        ['Маскировка',                          '4', 'Обаяние',   '-'],
        ['Прислушивание',                       '4', 'Мудрость',  '-'],
        ['Расшифровка',                         '4', 'Интеллект', '-'],
        ['Сбор информации',                     '4', 'Обаяние',   '-'],
        ['Ловкие Руки',                         '4', 'Ловкость',  '-1'],
      ]
    },
  },
  {
    KEY: 'table 3-5',
    NAME: 'Таблица 3-5: Варвар',
    DATA: {
      header: {
        value: [
          [
            'Базовый уровень',
            'Бонус Атаки',
            'Спасбросок Стойкости',
            'Спасбросок Рефлексов',
            'Спасбросок Воли',
            'Особое',
          ],
        ],
      },
      // prettier-ignore
      body: [
        ['1', '+1',               '+2',  '+0', '+0', 'Ярость 1/день; безграмотность, повышенное передвижение'],
        ['2', '+2',               '+3',  '+0', '+0', 'Сверхъестественное уворачивание'],
        ['3', '+3',               '+3',  '+1', '+1', 'Ощущение ловушек +1'],
        ['4', '+4',               '+4',  '+1', '+1', 'Ярость 2/день'],
        ['5', '+5',               '+4',  '+1', '+1', 'Улучшенное сверхъестественное уворачивание'],
        ['6', '+6/+1',            '+5',  '+2', '+2', 'Ощущение ловушек +2'],
        ['7', '+7/+2',            '+5',  '+2', '+2', 'Снижение повреждений 1/—'],
        ['8', '+8/+3',            '+6',  '+2', '+2', 'Ярость 3/день'],
        ['9', '+9/+4',            '+6',  '+3', '+3', 'Ощущение ловушек +3'],
        ['10', '+10/+5',          '+7',  '+3', '+3', 'Снижение повреждений 2/—'],
        ['11', '+11/+6/+1',       '+7',  '+3', '+3', 'Повышенная ярость'],
        ['12', '+12/+7/+2',       '+8',  '+4', '+4', 'Ярость 4/день, Ощущение ловушек +4'],
        ['13', '+13/+8/+3',       '+8',  '+4', '+4', 'Снижение повреждений 3/—'],
        ['14', '+14/+9/+4',       '+9',  '+4', '+4', 'Непробиваемая воля'],
        ['15', '+15/+10/+5',      '+9',  '+5', '+5', 'Ощущение ловушек +5'],
        ['16', '+16/+11/+6/+1',   '+10', '+5', '+5', 'Снижение повреждений 4/—, ярость 5/день'],
        ['17', '+17/+12/+7/+2',   '+10', '+5', '+5', 'Неутомимая ярость'],
        ['18', '+18/+13/+8/+3',   '+11', '+6', '+6', 'Ощущение ловушек +6'],
        ['19', '+19/+14/+9/+4',   '+11', '+6', '+6', 'Снижение повреждений 5/—'],
        ['20', '+20/+15/+10/+5',  '+12', '+6', '+6', 'Могучая ярость, ярость 6/день'],
      ]
    },
  },
  {
    KEY: 'table 3-5-1',
    DATA: {
      header: {
        value: [['Навык', 'Ранги', 'Параметр', 'Доспех']],
      },
      // prettier-ignore
      body: [
        ['Взбирание',           '4', 'Сила',      '-1'],
        ['Искусство Выживания', '4', 'Мудрость',  '-'],
        ['Прислушивание',       '4', 'Мудрость',  '-'],
        ['Прыжки',              '4', 'Сила',      '-1'],
        ['Плавание',            '4', 'Сила',      '-2'],
        ['Езда Верхом',         '4', 'Ловкость',  '-'],
        ['Запугивание',         '4', 'Обаяние',   '-'],
        ['Отслеживание (ск)',   '2', 'Мудрость',  '-'],
      ]
    },
    addition: [`*–1 за каждые 2,2 кг снаряжения`],
  },
  {
    KEY: 'table 3-6',
    NAME: 'Таблица 3-6: Воин',
    DATA: {
      header: {
        value: [
          [
            'Базовый Уровень',
            'Бонус Атаки',
            'Спасбросок Стойкости',
            'Спасбросок Рефлексов',
            'Спасбросок Воли',
            'Особое',
          ],
        ],
      },
      // prettier-ignore
      body: [
        ['1', '+1',               '+2',  '+0', '+0', 'Бонусная черта'],
        ['2', '+2',               '+3',  '+0', '+0', 'Бонусная черта'],
        ['3', '+3',               '+3',  '+1', '+1', ''],
        ['4', '+4',               '+4',  '+1', '+1', 'Бонусная черта'],
        ['5', '+5',               '+4',  '+1', '+1', ''],
        ['6', '+6/+1',            '+5',  '+2', '+2', 'Бонусная черта'],
        ['7', '+7/+2',            '+5',  '+2', '+2', ''],
        ['8', '+8/+3',            '+6',  '+2', '+2', 'Бонусная черта'],
        ['9', '+9/+4',            '+6',  '+3', '+3', ''],
        ['10', '+10/+5',          '+7',  '+3', '+3', 'Бонусная черта'],
        ['11', '+11/+6/+1',       '+7',  '+3', '+3', ''],
        ['12', '+12/+7/+2',       '+8',  '+4', '+4', 'Бонусная черта'],
        ['13', '+13/+8/+3',       '+8',  '+4', '+4', ''],
        ['14', '+14/+9/+4',       '+9',  '+4', '+4', 'Бонусная черта'],
        ['15', '+15/+10/+5',      '+9',  '+5', '+5', ''],
        ['16', '+16/+11/+6/+1',   '+10', '+5', '+5', 'Бонусная черта'],
        ['17', '+17/+12/+7/+2',   '+10', '+5', '+5', ''],
        ['18', '+18/+13/+8/+3',   '+11', '+6', '+6', 'Бонусная черта'],
        ['19', '+19/+14/+9/+4',   '+11', '+6', '+6', ''],
        ['20', '+20/+15/+10/+5',  '+12', '+6', '+6', 'Бонусная черта'],
      ]
    },
  },
  {
    KEY: 'table 3-6-1',
    DATA: {
      header: {
        value: [['Навык', 'Ранги', 'Параметр', 'Доспех']],
      },
      // prettier-ignore
      body: [
        ['Взбирание',           '4', 'Сила',       '-6'],
        ['Прыжки',              '4', 'Сила',       '-6'],
        ['Езда Верхом',         '4', 'Ловкость',   '-'],
        ['Плавание',            '4', 'Сила',       '-12'],
        ['Прислушивание (ск)',  '2', 'Мудрость',   '-'],
        ['Поиск (ск)',          '2', 'Интеллект',  '-'],
        ['Отслеживание (ск)',   '2', 'Мудрость',   '-'],
      ]
    },
  },
  {
    KEY: 'table 3-6-2',
    DATA: {
      header: {
        value: [['Навык', 'Ранги', 'Параметр', 'Доспех']],
      },
      // prettier-ignore
      body: [
        ['Взбирание',           '4', 'Сила',       '-4'],
        ['Прыжки',              '4', 'Сила',       '-4'],
        ['Езда Верхом',         '4', 'Ловкость',   '-'],
        ['Плавание',            '4', 'Сила',       '-8'],
        ['Запугивание',         '4', 'Обаяние',    '-'],
        ['Прислушивание (ск)',  '2', 'Мудрость',   '-'],
        ['Поиск (ск)',          '2', 'Интеллект',  '-'],
        ['Отслеживание (ск)',   '2', 'Мудрость',   '-'],
      ]
    },
  },
]
