export default [
  {
    key: "half-orc",
    name: "Полуорк",
    description: [
      {
        label: "История",
        value: `В диких краях, варварские племена орков и людей проживает в 
        крайне хрупком балансе, сражаясь, друг другом в войнах, и торгуя во 
        времена перемирий. Полуорки, те, кто родился от человека и орка, но 
        их не воспринимает ни та, ни другая культуры. Некоторые по разным причинам 
        покидают свой дом, и направляются в цивилизованные земли, принося с собой из 
        диких мест бесстрашие, храбрость, и боевой героизм.`
      },
      {
        label: "Индивидуальность",
        value: `Полуорки раздражительны и угрюмы. Они скорее будут действовать, 
        чем размышлять, и скорее сражаться, чем выяснять. Те, кто более везучи, 
        не настолько безумны, и способны контролировать себя, способны прожить в 
        землях цивилизации. Полуорки любят простые удовольствия: покушать, выпить, 
        похвастаться, попеть, побороться, и потанцевать дикие танцы. Такие радости 
        как: поэзия, культурные танцы, философия им не доступны. Подходящей группе он 
        будет ценным вкладом. На великосветском балу герцогини, он явно не впишется.`
      },
      {
        label: "Внешность",
        value: `Полуорки ростом 1,8–2,1 метр, весят они между 81 кг. и 112,5 кг. У 
        полуорков кожа серого оттенка, покатый лоб, выпяченная нижняя челюсть, торчащие 
        зубы, и грубые взлохмаченные волосы на теле, все признаки явно указывающие на 
        его происхождение. Оркам нравятся шрамы. Шрам полученные в бою считаются наградой, 
        а особенные шрамы признаком красоты. Любой полуорк проживающий среди, или рядом 
        с орками имеет шрамы, они являются знаком стыда обозначая его рабство, и указывая 
        на его бывшего хозяина, или знак награды указывая на его завоевания и его высокий 
        статус. Полуорк живущий среди людей, может как скрывать, так и показывать свои шрамы, 
        все зависит от отношения к ним. Зрелыми полуорки становятся немного быстрее, чем люди, 
        где-то в 14 лет, и соответственно стареют тоже. Лишь некоторые из полуорков проживают 
        более чем 75 лет.`
      }
    ]
  }
];
