export default {
  title: 'Основы создания персонажа',
  urlPath: '/character-creation-basics',
  links: [
    {
      name: 'Основы создания персонажа',
      key: 'content',
      data: [
        {
          name: 'Введение',
          key: 'description',
          value: [
            {
              value: [
                `Просмотрите с 1 по 5 Главы, а затем следуя этим шагам создайте
                персонажа 1-го уровня. Из материала вам понадобятся: копия
                карточки игрока, карандаш, несколько листов бумаги для
                различных записей, и четыре шестигранных кубика.`,
              ],
            },
          ],
        },
        {
          name: 'Посоветуйтесь с вашим МП',
          key: 'consult',
          value: [
            {
              value: [
                `У вашего МП могут свои домашние правила. Вам также
                нужно будет поинтересоваться какие персонажи (их классы,
                расы) уже участвуют в игре, для того, что бы ваш персонаж
                хорошо гармонировал в группе.`,
              ],
            },
          ],
        },
        {
          name: 'Набросайте показатели параметров',
          key: 'parameters',
          value: [
            {
              value: [
                `Набросайте каждый из параметров. Для этого, бросьте
                четыре шестигранника, игнорируя самый нижний показатель,
                и просуммируйте оставшиеся три. Запишите все шесть
                результатов на черновой бумаге.`,
                `Для дополнительных деталей смотрите Главу 1 (на
                следующей странице).`,
              ],
            },
          ],
        },
        {
          name: 'Выберите класс и расу',
          key: 'chose-race-and-class',
          value: [
            {
              value: [
                `Выберите одновременно расу и класс для вашего персонажа,
                так как некоторые расы более удобны для некоторых классов.
                Классы приведенные Главе 3: бард, варвар, воин, вор, друид,
                жрец, маг, монах, паладин, рейнджер, чародей. В разделе
                «Расы» вы сможете посмотреть какие расы и классы наиболее
                совместимы. Расы рассмотренные в Главе 2: дварф, гном,
                полу-орк, полу-эльф, халфлинг, человек, эльф.`,
                `Запишите на карточке выбранные расу и класс`,
              ],
            },
          ],
        },
        {
          name: 'Распределите и откорректируйте параметры',
          key: 'distribute-parameters',
          value: [
            {
              value: [
                `Теперь зная расу и класс вашего персонажа, соответственно
                показателей ваших шести способностей, которые вы кидали в
                1 пункте: Сила, Ловкость, Телосложение, Интеллект, Мудрость
                и Обаяние, модифицируйте их вверх и вниз соответственно с
                расой вашего персонажа, модификаторы указаны в Таблице
                2-1: Расовые модификаторы параметров (стр. 12).`,
                `Самые высокие показатели ставьте для поддержки вашего
                выбора класса. В каждом описании класса есть заголовок
                «Параметры», в котором указаны наиболее важные параметры
                для класса, и советы относительно их.`,
                `Для каждого параметра запишите модификатор. Смотрите
                в Таблице 1-1: Модификаторы параметров и Бонусные
                заклинания (стр. 8). Модификаторы параметров оказывают
                влияние на множество бросков кубиков в игре, включая:
                броски атаки, броски повреждений, проверки навыков и спасброски.`,
                `Запишите на карточке откорректированные показатели
                параметров и их модификаторы.`,
              ],
            },
          ],
        },
        {
          name: 'Обзор стартового пакета',
          key: 'starter-pack-overview',
          value: [
            {
              value: [
                `В конце каждого класса в 3 Главе, вам будет предложен
                как минимум один стартовый пакет. Просмотрите его. Он
                позволит быстро выполнить несколько шагов создания вашего
                персонажа. Если вам подходят черты, навыки и снаряжение,
                описанные для персонажа выбранного вами класса, тогда вы
                можете записать эту информацию на вашу карточку игрока.
                Но вы можете, и самостоятельно подобрать всю информацию
                из нижеследующих глав.`,
              ],
            },
          ],
        },
        {
          name: 'Запишите расовые и классовые признаки',
          key: 'write-attributes',
          value: [
            {
              value: [
                `Раса и класс вашего персонажа, дают вам определенный ряд
                плюсов и минусов. Большинство признаков автоматические,
                но часть из них связаны с выбором. Некоторые решения
                подразумевают размышления на будущее, о предстоящих
                действиях героя. Посмотрите всю книгу, если вам это
                необходимо, не бойтесь изучать и узнавать.`,
              ],
            },
          ],
        },
        {
          name: 'Выбор навыков',
          key: 'skill-selection',
          value: [
            {
              value: [
                `В зависимости от класса вашего персонажа и его модификатора
                Интеллекта, вы получите определенное количество очков
                для покупки навыков (смотрите стр. 6_). Каждый навык
                измеряется в рангах. Каждый ранг добавляет +1 (к броскам
                проверки), для успешной проверки навыка.`,
                `На 1-м уровне ваш персонаж может приобрести до 4-х
                рангов в классовом навыке (навык из списка всех навыков
                относящихся к классу вашего персонажа), или до 2-х рангов
                в навыках смежных классов (навык из списка навыков других
                классов).`,
                `Приобретение и развитие навыка будет лучше, если вы
                потратите 4 пункта навыков (ваш максимум) на каждый
                выбранный навык, как приведено в стартовых пакетах.`,
                `Как только вы выбрали навыки, определите для каждого
                ключевой Параметр. Когда вы будете записывать ваши навыки
                на карточке игрока, запишите модификаторы Параметра в
                графе с одноименным наименованием.`,
                `Таблица 4–2: Навыки (стр. 6_) приводит список всех
                навыков в игре, и указывает какие навыки являются
                классовыми для разных классов.`,
              ],
            },
          ],
        },
        {
          name: 'Выбор черт персонажа',
          key: 'skill-traits',
          value: [
            {
              value: [
                `У каждого 1 уровневого персонажа есть одна черта. Смотрите
                Таблица 5-1: Отличительные Черты (стр 9_), со списком всех
                черт, и необоходимыми условиями (если таковые есть), а
                также кратким описанием.`,
              ],
            },
          ],
        },
        {
          name: 'Ознакомление с описанием',
          key: 'introducing-desc',
          value: [
            {
              value: [
                `Просмотрите Главу 6: Описание. Это поможет вам лучше
                детализировать вашего персонажа. Вы можете определится с
                деталями сейчас, или немного позже.`,
              ],
            },
          ],
        },
        {
          name: 'Выбор снаряжения',
          key: 'equipment-selection',
          value: [
            {
              value: [
                `Если вы не используете снаряжение приведенное
                в стартовом пакете для каждого класса, вы можете
                самостоятельно приобрести своё стартовое снаряжение
                (смотрите стр. 11_), используя информацию из 7 Главы:
                Снаряжение.`,
              ],
            },
          ],
        },
        {
          name: 'Запишите показатели боя',
          key: 'write-battle-attr',
          value: [
            {
              value: [
                `Определите эти данные, и запишите их на своей карточке
                игрока.`,
              ],
            },
            {
              label: 'Хит-Поинты',
              value: [
                `Ваши хит-поинты (хп), определяют
                насколько тяжело убить вашего персонажа. Персонажи 1-
                го уровня получают: маги и чародеи по 4 хп, воры и барды
                по 6хп, жрецы, друиды и монахи по 8 хп, воины, паладины
                рейнджеры по 10 хп, и варвары по 12 хп. К этому количеству
                приплюсовывается модификатор Телосложения вашего
                персонажа.`,
              ],
            },
            {
              label: 'Класс Доспеха',
              value: [
                `Ваш Класс Доспеха (КД) указывает на то,
                как сложно будет попасть по вашему персонажу в сражении.
                Просуммируйте вместе следующие показатели: 10+ваш бонус
                доспеха+бонус щита+модификатор размера+модификатор
                Ловкости.`,
              ],
            },
            {
              label: 'Инициатива',
              value: [
                `Модификатор инициативы вашего
                персонажа равен модификатору вашей Ловкости. Если
                вы выбрали Улучшенную Инициативу, вы получаете
                дополнительный модификатор.`,
              ],
            },
            {
              label: 'Бонус Атаки',
              value: [
                `Ваш класс определяет базовый бонус
                атаки. Для определения вашего бонуса в рукопашных атаках,
                добавьте модификатор Силы к вашему базовому бонусу атаки.
                Для стрелковых атак добавляйте к базовому бонус атаки ваш
                модификатор Ловкости.`,
              ],
            },
            {
              label: 'Спас-броски',
              value: [
                `Ваш класс определяет базовый бонус
                спас-броска. К этим числам добавляйте ваш модификатор
                Телосложения для определения бонуса спас-броска
                Стойкости, модификатор Ловкости для спас-броска Ловкости,
                и модификатор Мудрости для спас-броска Воли.`,
              ],
            },
          ],
        },
        {
          name: 'Детали, детали и еще раз детали',
          key: 'details',
          value: [
            {
              value: [
                `Теперь придумайте или выберите из предложенного списка
                имя персонажа, определите его пол, мировоззрение, возраст,
                внешний вид и т.д. Глава 6: Описание поможет вам в этом.`,
                `Особой надобности полного создания персонажа нет,
                с разрешения вашего МП вы бы могли добавлять, изменять
                какие-то детали, в зависимости от игры, для того, что бы
                лучше ощутить своего персонажа.`,
              ],
            },
          ],
        },
      ],
    },
  ],
}
