export default {
  title: "Классы",
  urlPath: "/classes",
  links: [
    {
      key: "priest",
      name: "Жрец/Священник",
      data: [
        {
          name: "Описание",
          key: "description",
          value: [
            {
              label: "История",
              value: `Боги сопровождают нас повсюду, в поразительных природных
              местах, в благородных крестовых походах, в церковных обрядах, в
              сердцах последователей. Как и люди, боги бывают различные: от
              благодушных до злых сердцем, ненавязчивых
              и наоборот, простых или загадочных. Однако боги большинство
              своей работы выполняют через своих посредников –
              жрецов. Добрые жрецы лечат, защищают, мстят за невинных.
              Злые – грабят, разрушают, занимаются вредительством. Жрецы
              используют силу бога, чтобы воплотить волю бога. Также
              с помощью этой силы жрецы предрешают свою судьбу.`
            }
          ]
        }
      ]
    }
  ]
};
