export default {
  title: "Заклинания",
  urlPath: "/spells",
  links: [
    {
      name: "Заклинания жреца",
      key: "prst",
      data: [
        {
          name: "0-го уровня",
          key: "0-lvl",
          value: [
            {
              label: "Добродетель",
              value: [`Субъект получает 1 временный хит-поинт.`]
            },
            {
              label: "Лечение Мелких Ранений",
              value: [`Излечивает 1 пункт повреждений.`]
            },
            {
              label: "Обнаружение Магии",
              value: [
                `Определяет заклинания и магические
              предметы в пределах 18 м.`
              ]
            },
            {
              label: "Обнаружение Яда",
              value: [
                `Обнаруживает яд в одном существе или
                маленьком объекте.`
              ]
            },
            {
              label: "Очистить Пищу и Воду",
              value: [`Очищает 0,3 куб. м./уровень еды или воды.`]
            },
            {
              label: "Починка",
              value: [`Выполняет мелкий ремонт на объекте.`]
            },
            {
              label: "Причинить Мелкие Ранения",
              value: [
                `Касательная атака, 1 пункт
              повреждений.`
              ]
            },
            {
              label: "Руководство",
              value: [`+1 к одному броску атаки, спас-броску, проверке.`]
            },
            {
              label: "Свет",
              value: [`Объект сияет как факел.`]
            },
            {
              label: "Создать Воду",
              value: [`Создаёт 9 литров/уровень чистой воды`]
            },
            {
              label: "Устойчивость",
              value: [`Субъект получает + 1 бонус к спас-броскам`]
            },
            {
              label: "Чтение Магии",
              value: [
                `Даёт возможность читать свитки и книги
              заклинаний.`
              ]
            }
          ]
        },
        {
          name: "1-го уровня",
          key: "1-lvl",
          value: [
            {
              label: "Благословение",
              value: [
                `Союзники получают +1 к атаке и +1 к спасброскам против страха`
              ]
            },
            {
              label: "Благословить Воду(м)",
              value: [`Создаёт святую воду`]
            },
            {
              label: "Божье Расположение",
              value: [
                `Вы получает бонус +1/три уровня к атаке
              и повреждению.`
              ]
            },
            {
              label: "Защита от Добра/Закона/Зла/Хаоса",
              value: [
                `Защита от элементалей и
                внешних, даёт +2 к КД и спас-броскам, противостоит контролю
                над разумом.`
              ]
            },
            {
              label: "Команда",
              value: [
                `Один субъект подчиняется однословным командам на
                протяжении 1 раунда.`
              ]
            },
            {
              label: "Лечение Лёгких Ранений",
              value: [
                `Излечивает 1d8+1/уровень
                повреждений (макс. +5).`
              ]
            },
            {
              label: "Магический Камень",
              value: [
                `Три камня получают +1 бонус к атаке, и
                причиняют 1d6+1 повреждений.`
              ]
            },
            {
              label: "Магическое Оружие",
              value: [`Оружие получает +1 бонус.`]
            },
            {
              label: "Наслать Страх",
              value: [
                `Одно существо с 5 КХП и менее убегает в
              течение 1d4 раунда.`
              ]
            },
            {
              label: "Невидимость для Нежити",
              value: [
                `Нежить не замечает 1 субъекта/
                уровень.`
              ]
            },
            {
              label: "Обнаружение Добра/Закона/Зла/Хаоса",
              value: [
                `Показывает существ,
                заклинания или объекты.`
              ]
            },
            {
              label: "Обнаружение Нежити",
              value: [`Показывает нежить в пределах 18 м`]
            },
            {
              label: "Понимание Языков",
              value: [
                `Понимание всех разговорных и написанных
              языков.`
              ]
            },
            {
              label: "Призыв Монстра I",
              value: [`Призывает вам на помощь внешнее существо`]
            },
            {
              label: "Причинить Легкие Ранения",
              value: [
                `Касание причиняет 1d8+1/уровень
              повреждений (макс. +5).`
              ]
            },
            {
              label: "Проклясть Воду(м)",
              value: [`Создаёт проклятую воду.`]
            },
            {
              label: "Противостоять Элементам",
              value: [
                `Вы себя нормально чувствуете в
              холодной или горячей среде.`
              ]
            },
            {
              label: "Погибель",
              value: [
                `Один субъект страдает от штрафов -2 к броскам атаки
                и повреждения, спас-броскам, иным проверкам.`
              ]
            },
            {
              label: "Скрывающий Туман",
              value: [`Туман окружает вас.`]
            },
            {
              label: "Смертовзгляд",
              value: [
                `Показывает насколько сильно ранены субъекты
              в пределах 9 м`
              ]
            },
            {
              label: "Снять Страх",
              value: [`+4 к спас-броскам против страха; +1/четыре уровня`]
            },
            {
              label: "Убежище",
              value: [
                `Оппоненты не могут атаковать вас, а вы не можете
              атаковать их.`
              ]
            },
            {
              label: "Чума",
              value: [
                `Враги переносят штраф –1 к атаке, –1 к спас-броскам
                против страха.`
              ]
            },
            {
              label: "Щит Судьбы",
              value: [`Аура даёт вам +2 или выше бону отклонения.`]
            },
            {
              label: "Энтропический Щит",
              value: [`У стрелковых атак 20% шанс промаха по вам.`]
            }
          ]
        },
        {
          name: "2-го уровня",
          key: "2-lvl",
          value: [
            {
              label: "Вдребезги",
              value: [
                `Звуковая вибрация наносит повреждения объектам
              или кристаллическим существам.`
              ]
            },
            {
              label: "Великолепие Орла",
              value: [
                `Субъект получает 1d4+1 Обн на 1 час/
                уровень.`
              ]
            },
            {
              label: "Воззрить Оружие",
              value: [
                `Оружие становится добрым, законным, злым
                или хаотичным.`
              ]
            },
            {
              label: "Восстановление, Ограниченное",
              value: [
                `Рассеивает магический штраф
                к параметру, или восстанавливает 1d4 повреждений параметра.`
              ]
            },
            {
              label: "Выносливость Медведя",
              value: [
                `Субъект получает 1d4+1 Тело на 1 час/
                уровень.`
              ]
            },
            {
              label: "Духовное Оружие",
              value: [`Магическое оружие атакует своего владельца.`]
            },
            {
              label: "Заботливый Уход",
              value: [`Сохраняет одно погибшее тело.`]
            },
            {
              label: "Замедлить Яд",
              value: [
                `Замедляет разрушительный эффект яда на
              субъекта в течение 1 час/уровень.`
              ]
            },
            {
              label: "Зона Правды",
              value: [
                `В пределах зоны действия заклинания, субъекты
                не могут лгать.`
              ]
            },
            {
              label: "Лечение Средних Ранений",
              value: [
                `Излечивает 2d8+1/уровень
                повреждений (макс. +10).`
              ]
            },
            {
              label: "Мудрость Совы",
              value: [`Субъект получает 1d4+1 Мудр на 1 час/уровень.`]
            },
            {
              label: "Неопределимое Мировоззрение",
              value: [
                `Скрывает мировоззрение на 24
              часа.`
              ]
            },
            {
              label: "Обнаружение Ловушек",
              value: [`Возможность замечать ловушки как и вор`]
            },
            {
              label: "Освятить(м)",
              value: [
                `Заполняет зону позитивной энергией, делает нежить
              слабее.`
              ]
            },
            {
              label: "Осквернить(м)",
              value: [
                `Заполняет местность негативной энергией, делая
              в ней сильнее нежить`
              ]
            },
            {
              label: "Ощитить Других(ф)",
              value: [
                `Вы берёте на себя половину повреждений
              субъекта.`
              ]
            },
            {
              label: "Помощь",
              value: [
                `+1 к атаке, +1 к спас-броскам против страха, временные
              1d8 хит-поинтов.`
              ]
            },
            {
              label: "Порабощение",
              value: [`Ловит всё, что в пределах 30 м+3 м/уровень.`]
            },
            {
              label: "Предвестие(м,ф)",
              value: [
                `Даёт вам знать какое действие будет плохим, а
              какое хорошим.`
              ]
            },
            {
              label: "Призыв Монстра II",
              value: [`Призывает вам на помощь внешнее существо.`]
            },
            {
              label: "Причинить Средние Ранения",
              value: [
                `Касательная атака, 2d8+1/
              уровень повреждений (макс. +10).`
              ]
            },
            {
              label: "Сила Быка",
              value: [`Субъект получает 1d4+1 Силы на 1 час/уровень.`]
            },
            {
              label: "Смертельный Звон",
              value: [
                `Убивает существо при смерти; вы получает
              1d8 временных хит-поинтов, +2 Сила, и +1 уровень.`
              ]
            },
            {
              label: "Снять Паралич",
              value: [
                `Освобождает одно или более существ от
              парализа, удерживания, или замедления.`
              ]
            },
            {
              label: "Собрать Воедино",
              value: [`Ремонтирует объект.`]
            },
            {
              label: "Статус",
              value: [`Отслеживает состояние и положение союзников.`]
            },
            {
              label: "Струя Звука",
              value: [
                `Причиняет 1d8 звуковых повреждений субъектам;
              может их ошеломить.`
              ]
            },
            {
              label: "Темнота",
              value: [`Образуется сверхъестественная темнота радиусом в 6 м.`]
            },
            {
              label: "Тишина",
              value: [`Нейтрализует звук в зоне с радиусом 4,5 м.`]
            },
            {
              label: "Удержание Персоны",
              value: [
                `Делает одну персону беззащитной на
              протяжении 1 раунд/уровень.`
              ]
            },
            {
              label: "Успокоить Эмоции",
              value: [
                `Успокаивает 1d6 субъектов/уровень,
              нейтрализует эффекты эмоции.`
              ]
            },
            {
              label: "Устойчивость к Энергии",
              value: [
                `Игнорирует первые 12 повреждений/
              раунд от одного из типов энергии.`
              ]
            }
          ]
        },
        {
          name: "3-го уровня",
          key: "3-lvl",
          value: [
            {
              label: "Анимировать Мертвеца(м)",
              value: [`Создаёт скелетов и зомби.`]
            },
            {
              label: "Глиф Опеки(м)",
              value: [
                `Надписи повреждают того кто проходит через
              них.`
              ]
            },
            {
              label: "Глубокая Темнота",
              value: [
                `От объекта исходит абсолютная тьма в
              радиусе 18 метров.`
              ]
            },
            {
              label: "Глухота/Слепота",
              value: [`Делает субъекта глухим или слепым.`]
            },
            {
              label: "Говорить с Мёртвыми",
              value: [
                `Труп отвечает на один вопрос/два уровня.
              Дневной Свет: Яркий свет с радиусом 18 м.`
              ]
            },
            {
              label: "Дневной Свет",
              value: [`Яркий свет с радиусом 18 м.`]
            },
            {
              label: "Дыхание под Водой",
              value: [`Субъект способен дышать под водой.`]
            },
            {
              label: "Защита от Энергии",
              value: [
                `Поглощает 12 повреждений/уровень одного
              из видов энергии.`
              ]
            },
            {
              label: "Излечить Болезнь",
              value: [`Излечивает все болезни у субъекта.`]
            },
            {
              label: "Инфекция",
              value: [`Заражает субъекта определенной болезней.`]
            },
            {
              label: "Круг Волшебства против Добра/Закона/Зла/Хаоса",
              value: [
                `Как заклинание защита, но с радиусом 3 м и 10 мин./уровень.`
              ]
            },
            {
              label: "Лечение Серьёзных Ранений",
              value: [
                `Излечивает 3d8+1/уровень
              повреждений (макс. +15).`
              ]
            },
            {
              label: "Магическое Одеяние",
              value: [
                `Доспехи или щит получают +1 бонус
              колдовства/три уровня.`
              ]
            },
            {
              label: "Молитва",
              value: [
                `Союзники получают +1 к броскам атаки, противники
              –1 штраф.`
              ]
            },
            {
              label: "Наложить Проклятие",
              value: [
                `–6 к параметру; –4 к атакам; спас-броскам
              и проверкам; или 50% шанс потери своего действия.`
              ]
            },
            {
              label: "Обнаружить Объект",
              value: [
                `Указывает направление к объекту
              (специфическому или разновидности).`
              ]
            },
            {
              label: "Очищение Невидимости",
              value: [
                `Рассеивает невидимость в пределах
              1,5 м./уровень.`
              ]
            },
            {
              label: "Призыв Монстра III",
              value: [`Призывает вам на помощь внешнее существо.`]
            },
            {
              label: "Причинить Серьёзные Ранения",
              value: [
                `Касательная атака 3d8+1/
              уровень повреждений (макс. +15).`
              ]
            },
            {
              label: "Продолжительное Пламя(м)",
              value: [
                `Создаёт постоянный, не
              излучающий тепла факел.`
              ]
            },
            {
              label: "Прожигающий Луч",
              value: [
                `Луч причиняет 1d8/два уровня повреждений,
              нежити ещё больше.`
              ]
            },
            {
              label: "Рассеивание Магии",
              value: [`Снимает магические эффекты и заклинания.`]
            },
            {
              label: "Рука Помощи",
              value: [`Призрачная рука приводит к вам субъекта.`]
            },
            {
              label: "Скрыть Объект",
              value: [`Маскирует объект от ворожбы.`]
            },
            {
              label: "Слиться с Камнем",
              value: [`Вы и ваше снаряжение сливается с камнем.`]
            },
            {
              label: "Создать Воду и Пищу",
              value: [
                `Создаёт такое количество, чтобы
              накормить/напоить трёх человек (или одну лошадь)/уровень.`
              ]
            },
            {
              label: "Снять Глухоту/Слепоту",
              value: [
                `Излечивает обычное или магическое
              состояние.`
              ]
            },
            {
              label: "Снять Проклятие",
              value: [`Освобождает объект или персону от проклятия.`]
            },
            {
              label: "Стена Ветра",
              value: [`Отклоняет стрелы, небольших существ и газы.`]
            },
            {
              label: "Форма Камня",
              value: [
                `Заставляет камень принять указанную вами
              форму.`
              ]
            },
            {
              label: "Хождение по Воде",
              value: [
                `Субъекты передвигаются по воде как по
              твёрдой поверхности.`
              ]
            }
          ]
        }
      ]
    },
    {
      name: "Сферы жрецов",
      key: "sphere-of-prsts",
      data: [
        {
          name: "Сфера воды",
          key: "water-sphere",
          value: [
            {
              label: "Божество",
              value: [`Обад-Хай`]
            },
            {
              label: "Даруемые Силы",
              value: [`Изгонять или разрушать существ огня,
              точно также как добрый жрец изгоняет нежить. Подчинять
              и командовать существами воды, как злой жрец подчиняет
              нежить. Эти способности можно применять до 3+модификатор
              Обаяния в день`]
            },
            {
              label: "ЗАКЛИНАНИЯ СФЕРЫ ВОДЫ"
            },
            {
              label: "1. Скрывающий Туман",
              value: [`Туман окружает вас`]
            },
            {
              label: "2. Облако Тумана",
              value: [`Туман закрывает обзор`]
            },
            {
              label: "3. Дыхание под Водой",
              value: [`Субъект способен дышать под водой`]
            },
            {
              label: "4. Контроль Воды",
              value: [`Понижает или повышает уровень воды`]
            },
            {
              label: "5. Ледяной Шторм",
              value: [`Град в цилиндре с поперечником 12 м. причиняет 5d6 повреждений`]
            },
            {
              label: "6. Конус Холода",
              value: [`1d6 повреждений/уровень холодом`]
            },
            {
              label: "7. Кислотный Туман",
              value: [`Туман причиняет кислотные повреждения.`]
            },
            {
              label: "8. Ужасающее Высыхание",
              value: [`Причиняет 1d6 повреждений/уровень
              в пределах 9 метров.`]
            },
            {
              label: "9. Орда Элементалей*",
              value: [`Призывает нескольких элементалей.
              *Применяется только как заклинание воды.`]
            },
          ]
        },
        {
          name: "Сфера путешествий",
          key: "travel-sphere",
          value: [
            {
              label: "Божество",
              value: [`Фхарлангхун`]
            },
            {
              label: "Даруемые Силы",
              value: [
                `На протяжение 1 раунда за каждый уровень
                жреца в день, вы способны нормально действовать вне
                зависимости от магического эффекта влияющего на ваше
                передвижение (наподобие эффекта заклинания свободное
                передвижение). При необходимости этот эффект активируется
                автоматически, и длится не дольше чем он необходим, может
                активироваться по несколько раз в день (но не более дневного
                ограничения в раундах). Это магическая способность.`,
                `Добавьте Искусство Выживание к классовым навыкам по
                жрецу.`
              ]
            },
            {
              label: "ЗАКЛИНАНИЯ СФЕРЫ ПУТЕШЕСТВИЙ"
            },
            {
              label: "1. Скороход",
              value: [`Ваша скорость повышается`]
            },
            {
              label: "2. Обнаружить Объект",
              value: [`Указывает направление к объекту
              (специфическому или разновидности)`]
            },
            {
              label: "3. Полёт",
              value: [`Субъект летает со скоростью 27 метров`]
            },
            {
              label: "4. Дверь Измерений",
              value: [`Телепортирует вас на некоторое расстояние`]
            },
            {
              label: "5. Телепорт",
              value: [`Мгновенно вас телепортирует в на 160 км./уровень`]
            },
            {
              label: "6. Обнаружение Пути",
              value: [`Указывает наиболее прямую дорогу к необходимому месту`]
            },
            {
              label: "7. Телепорт, Неограниченный",
              value: [`Как телепорт, но нет случайного
              прибытия, и больше диапазон перемещения.`]
            },
            {
              label: "8. Фазовая Дверь",
              value: [`Невидимый проход сквозь дерево или камень`]
            },
            {
              label: "9. Астральная Проекция(м)",
              value: [`Проецирует вас и ваших товарищей
              в Астральный План`]
            },
          ]
        },
        {
          name: "Сфера удачи",
          key: "luck-sphere",
          value: [
            {
              label: "Божество",
              value: [`Фхарлангун, Корд, Олидаммара`]
            },
            {
              label: "Даруемые Силы",
              value: [
                `Вы обладаете силой хорошей удачи,
                которая используется один раз в день. Эта экстраординарная
                способность позволяет вам повторно провести бросок, в случае
                неудовлетворительного результата при первом броске. Но, в
                любом случае вы используете результат повторного броска,
                даже если он хуже за первый бросок.`
              ]
            },
            {
              label: "ЗАКЛИНАНИЯ СФЕРЫ ПУТЕШЕСТВИЙ"
            },
            {
              label: "1. Энтропический Щит",
              value: [`У стрелковых атак 20% шанс промаха
              по вам.`]
            },
            {
              label: "2. Помощь",
              value: [`+1 к атаке, +1 к спас-броскам против страха,
              временные 1d8 хит-поинтов`]
            },
            {
              label: "3. Защита от Энергии",
              value: [`Поглощает 12 повреждений/раунд от
              одного из типов энергии`]
            },
            {
              label: "4. Свободное Передвижение",
              value: [`Субъект нормально передвигается
              несмотря преграды`]
            },
            {
              label: "5. Телепорт",
              value: [`Освобождает субъектов от колдовства,
              изменений, проклятий и окаменения`]
            },
            {
              label: "6. Ввести в Заблуждение",
              value: [`Делает вас невидимым, и создаёт
              вашего иллюзорного двойника`]
            },
            {
              label: "7. Отражение Заклинаний",
              value: [`Отражает 1d4+6 уровней заклинаний
              назад в заклинателя`]
            },
            {
              label: "8. Момент Предвидения",
              value: [`Вы получаете бонус проницательности
              к одному броску атаки, проверке или спас-броску`]
            },
            {
              label: "9. Чудо(о,п)",
              value: [`Просьба к божественному вмешательству`]
            },
          ]
        },
      ]
    },
    {
      name: "Заклинания мага и чародея",
      key: "mage",
      data: [
        {
          name: "0-го уровня",
          key: "0-lvl",
          value: [
            {
              label: "Устойчивость",
              value: [`Субъект получает + 1 бонус к спасброскам`],
              addition: "Защита"
            },
            {
              label: "Кислотный Всплеск",
              value: [`Сфера наносит 1d3 повреждений кислотой`],
              addition: "Колдовство"
            },
            {
              label: "Обнаружение Магии",
              value: [`Обнаруживает заклинания и
              магические предметы в пределах 18 м`],
              addition: "Ворожба"
            },
            {
              label: "Обнаружение Яда",
              value: [`Обнаруживает яд в одном
              существе или маленьком объекте`],
              addition: "Ворожба"
            },
            {
              label: "Чтение Магии",
              value: [`Даёт возможность читать свитки и
              книги заклинаний`],
              addition: "Ворожба"
            },
            {
              label: "Изумить",
              value: [`Существо с 4 КХП и меньше теряет свой
              следующий ход`],
              addition: "Очаров."
            },
            {
              label: "Вспышка",
              value: [`Ошеломляет одно существо (-1 атака)`],
              addition: "Заклят."
            },
            {
              label: "Замораживающий Луч",
              value: [`Луч наносит 1d3
              повреждений холодом`],
              addition: "Заклят."
            },
            {
              label: "Свет",
              value: [`Объект сияет как факел`],
              addition: "Заклят."
            },
            {
              label: "Танцующие Огоньки",
              value: [`Создает факелы, или иной
              источник света`],
              addition: "Заклят."
            },
            {
              label: "Призрачный Звук",
              value: [`Ложные звуки`],
              addition: "Иллюз."
            },
            {
              label: "Касание Усталости",
              value: [`Касательная атака делает
              существо уставшим`],
              addition: "Некро."
            },
            {
              label: "Покоробить Нежить",
              value: [`Причиняет 1d6 повреждений
              одному мертвецу`],
              addition: "Некро."
            },
            {
              label: "Открыть/Закрыть",
              value: [`Открывает или Закрывает
              маленькие или лёгкие предметы`],
              addition: "Превр."
            },
            {
              label: "Послание",
              value: [`Общение шепотом на расстоянии`],
              addition: "Превр."
            },
            {
              label: "Починка",
              value: [`Выполняет мелкий ремонт на объекте`],
              addition: "Превр."
            },
            {
              label: "Рука Мага",
              value: [`Телекинез с вещами весом до 2,25 кг`],
              addition: "Превр."
            },
            {
              label: "Волшебная Метка",
              value: [`Пишет личные руны (видимые,
                или невидимые)`],
              addition: "Универ."
            },
            {
              label: "Ловкость Рук",
              value: [`Позволяет выполнять несложные трюки`],
              addition: "Универ."
            },
          ]
        },
        {
          name: "1-го уровня",
          key: "1-lvl",
          value: [
            {
              label: "Защита от Добра/Закона/Зла/Хаоса",
              value: [`Защита от элементалей и внешних, даёт +2 к КД и спас-броскам,
                противостоит контролю над разумом`],
              addition: "Защита"
            },
            {
              label: "Противостоять Элементам",
              value: [`Вы себя нормально
              чувствуете в холодной или горячей среде`],
              addition: "Защита"
            },
            {
              label: "Тревога",
              value: [`Охрана территории на протяжении 2 часа/уровень`],
              addition: "Защита"
            },
            {
              label: "Удержание Портала",
              value: [`Сохраняет дверь открытой`],
              addition: "Защита"
            },
            {
              label: "Щит",
              value: [`Невидимый диск дает +4 к КД, и блокирует
              магические стрелы`],
              addition: "Защита"
            },
            {
              label: "Доспех Мага",
              value: [`Даёт субъекту +4 бонус к КД`],
              addition: "Колд-во"
            },
            {
              label: "Жир",
              value: [`Делает 3 кв. м. поверхности или один объект
              скользким`],
              addition: "Колд-во"
            },
            {
              label: "Призыв Монстра I",
              value: [`Призывает вам на помощь
              внешнее существо`],
              addition: "Колд-во"
            },
            {
              label: "Невидимый Слуга",
              value: [`Создаёт невидимую силу, которая
              подчиняется вашим командам`],
              addition: "Колд-во"
            },
            {
              label: "Скакун",
              value: [`Призывает лошадь на 2 ч./уровень`],
              addition: "Колд-во"
            },
            {
              label: "Скрывающий Туман",
              value: [`Туман окружает вас`],
              addition: "Колд-во"
            },
            {
              label: "Идентификация(м)",
              value: [`Определяет способности одного
              магического предмета`],
              addition: "Ворожба"
            },
            {
              label: "Истинный Удар",
              value: [`+20 бонус к вашей следующей атаке`],
              addition: "Ворожба"
            },
            {
              label: "Обнаружение Нежити",
              value: [`Показывает нежить в пределах 18 м`],
              addition: "Ворожба"
            },
            {
              label: "Обнаружение Секретных Дверей",
              value: [`Указывает на
              секретные двери в пределах 18 м`],
              addition: "Ворожба"
            },
            {
              label: "Понимание Языков",
              value: [`Понимание всех разговорных и
              написанных языков`],
              addition: "Ворожба"
            },
            {
              label: "Гипноз",
              value: [`Гипнотизирует 2d4 КХП существ`],
              addition: "Очаров."
            },
            {
              label: "Очаровать Персону",
              value: [`Заставляет одну персону быть
              вашим другом`],
              addition: "Очаров."
            },
            {
              label: "Сон",
              value: [`Заставляет 4 КХП существ впасть в коматозный сон`],
              addition: "Очаров."
            },
            {
              label: "Магическая Стрела",
              value: [`1d4+1 повреждений; +1 стрела/два 
              уровня после первого (макс. +5)`],
              addition: "Заклят."
            },
            {
              label: "Парящий Диск Тенсера",
              value: [`90 см. в диаметре диск,
              который может удерживать до 45,0 кг./уровень`],
              addition: "Заклят."
            },
            {
              label: "Пылающие Руки",
              value: [`1d4 повреждений/уровень огнём
              (макс. 5d4)`],
              addition: "Заклят."
            },
            {
              label: "Шокирующий Захват",
              value: [`Касание наносит 1d6/уровень
              повреждений электричеством (макс. 5d6)`],
              addition: "Заклят."
            },
            {
              label: "Магическая Аура Нистала",
              value: [`Изменяет магическую
              ауру объекта`],
              addition: "Иллюз."
            },
            {
              label: "Молчаливый Образ",
              value: [`Создаёт на ваш выбор
              незначительную иллюзию`],
              addition: "Иллюз."
            },
            {
              label: "Собственная Маскировка",
              value: [`Изменяет ваш внешний вид`],
              addition: "Иллюз."
            },
            {
              label: "Цветные Брызги",
              value: [`Вводят в бессознательное состояние,
              ослепляют или ослабляют 1d6 слабых существ`],
              addition: "Иллюз."
            },
            {
              label: "Чревовещание",
              value: [`Перемещает источник голоса на
              1 мин./уровень`],
              addition: "Иллюз."
            },
            {
              label: "Леденящее Прикосновение",
              value: [`1 касание/уровень причиняет 1d6 повреждений,
              и при возможности потерю 1 Силы`],
              addition: "Некро."
            },
            {
              label: "Наслать Страх",
              value: [`Одно существо с 5 КХП и менее
              убегает в течение 1d4 раундов`],
              addition: "Некро."
            },
            {
              label: "Ослабляющий Луч",
              value: [`Луч понижает Силу на 1d6
              пунктов+1/два уровня`],
              addition: "Некро."
            },
            {
              label: "Анимировать Верёвку",
              value: [`Заставляет верёвку двигаться
              по вашим командам`],
              addition: "Превр."
            },
            {
              label: "Магическое Оружие",
              value: [`Оружие получает +1 бонус`],
              addition: "Превр."
            },
            {
              label: "Падение как Перо",
              value: [`Объекты или существа замедленно
              падают`],
              addition: "Превр."
            },
            {
              label: "Прыжок",
              value: [`Субъект получает бонус к проверкам Прыжков`],
              addition: "Превр."
            },
            {
              label: "Стереть",
              value: [`Уничтожает обычные или магические надписи`],
              addition: "Превр."
            },
            {
              label: "Стремительное Отступление",
              value: [`Повышает вашу скорость на 9 м`],
              addition: "Превр."
            },
            {
              label: "Увеличить Персону",
              value: [`Гуманоидное существо
              выростает в два раза`],
              addition: "Превр."
            },
            {
              label: "Уменьшить Персону",
              value: [`Гуманоидное существо
              уменьшается в два раза`],
              addition: "Превр."
            },
          ]
        },
        {
          name: "2-го уровня",
          key: "2-lvl",
          value: [
            {
              label: "Волшебный Замок(м)",
              value: [`Магически запирает портал или
              сундук, двери`],
              addition: "Защита"
            },
            {
              label: "Защита от Стрел",
              value: [`Субъект иммунен к большинству
              стрелковых атак`],
              addition: "Защита"
            },
            {
              label: "Скрыть Объект",
              value: [`Маскирует объект от ворожбы`],
              addition: "Защита"
            },
            {
              label: "Устойчивость к Энергии",
              value: [`Игнорирование 10 (или
                более) пунктов повреждения/атаки указанного типа
                энергии`],
              addition: "Защита"
            },
            {
              label: "Кислотная Стрела Мельфа",
              value: [`Стрелковая касательная
              атака; 2d4 повреждений за раунд, +1 раунд/три уровня`],
              addition: "Колд-во"
            },
            {
              label: "Мерцапыль",
              value: [`Ослепляет существ, очерчивает невиди-
              мых созданий`],
              addition: "Колд-во"
            },
            {
              label: "Облако Тумана",
              value: [`Туман закрывает обзор`],
              addition: "Колд-во"
            },
            {
              label: "Паутина",
              value: [`Заполняет 3 куб. метра/уровень клейкой
              паутиной паука`],
              addition: "Колд-во"
            },
            {
              label: "Призыв Монстра II",
              value: [`Призывает вам на помощь
              внешнее существо`],
              addition: "Колд-во"
            },
            {
              label: "Призыв Роя",
              value: [`Призывает рой маленьких ползающих
              или летающих существ`],
              addition: "Колд-во"
            },
            {
              label: "Видеть Невидимое",
              value: [`Открывает невидимые объекты
              или субъектов`],
              addition: "Ворожба"
            },
            {
              label: "Обнаружить Объект",
              value: [`Указывает направление к объекту
              (специфическому или разновидности)`],
              addition: "Ворожба"
            },
            {
              label: "Чтение Мыслей",
              value: [`Позволяет «прослушивать» мысли
              окружающих`],
              addition: "Ворожба"
            },
            {
              label: "Изумить Чудовище",
              value: [`Живое существо с 6 КХП и
              меньше, теряет свое следующее действие`],
              addition: "Очаров"
            },
            {
              label: "Касание Идиотизма",
              value: [`Субъект переносит 1d6
              повреждений к Интл, Мудр и Обн`],
              addition: "Очаров"
            },
            {
              label: "Ужасающая Насмешка Таши",
              value: [`Субъект теряет свои
              действия на 1 раунд/уровень`],
              addition: "Очаров"
            },
            {
              label: "Вдребезги",
              value: [`Звуковая вибрация наносит повреждения
              объектам или кристаллическим существам`],
              addition: "Заклят"
            },
            {
              label: "Испепеляющий Луч",
              value: [`Стрелковая касательная атака
              наносит 4d6 повреждений огнем, +1 луч/четыре уровня
             (макс. 3)`],
              addition: "Заклят"
            },
            {
              label: "Порыв Ветра",
              value: [`Сдувает или опрокидывает небольших
              существ`],
              addition: "Заклят"
            },
            {
              label: "Продолжительное Пламя(м)",
              value: [`Создаёт постоянный, не
              излучающий тепла факел`],
              addition: "Заклят"
            },
            {
              label: "Пылающая Сфера",
              value: [`Крутящийся огненный шар нано-
              сит 2d6 повреждений, длится 1 раунд/уровень`],
              addition: "Заклят"
            },
            {
              label: "Темнота",
              value: [`Образуется сверхъестественная темнота
              радиусом в 6 м`],
              addition: "Заклят"
            },
            {
              label: "Гипнотический Узор",
              value: [`Гипнотизирует 2d4+уровень
              КХП существ`],
              addition: "Иллюз"
            },
            {
              label: "Зеркальный Образ",
              value: [`Создаёт путающие других, ваши
              двойники (1d4+1/три уровня, макс. 8)`],
              addition: "Иллюз"
            },
            {
              label: "Ловушка Леомунда(м)",
              value: [`Создаёт вид, что на предмете
              расположена ловушка`],
              addition: "Иллюз"
            },
            {
              label: "Магический Рот(м)",
              value: [`При инициировании начинает
              говорить`],
              addition: "Иллюз"
            },
            {
              label: "Малый Образ",
              value: [`Как молчаливый образ но может изда-
              вать звуки`],
              addition: "Иллюз"
            },
            {
              label: "Невидимость",
              value: [`Субъект невидим на протяжении 1 мин./
              уровень, или пока не проведёт атаку`],
              addition: "Иллюз"
            },
            {
              label: "Неправильный Курс",
              value: [`Нарушает ворожбу на одного
              объекта или существа`],
              addition: "Иллюз"
            },
            {
              label: "Размытость",
              value: [`Существует 20% того, что субъект в атаке
              промахнётся`],
              addition: "Иллюз"
            },
            {
              label: "Глухота/Слепота",
              value: [`Делает субъекта глухим или слепым`],
              addition: "Некро"
            },
            {
              label: "Испуг",
              value: [`Вводит в панику до 5 КХП существ (в радиусе 4,5 м.)`],
              addition: "Некро"
            },
            {
              label: "Касание Упыря",
              value: [`Парализует одного субъекта,
              ощущающего (-2 штраф) исходящий запах`],
              addition: "Некро"
            },
            {
              label: "Командование Нежитью",
              value: [`Существо нежить
              подчиняется вашим командам`],
              addition: "Некро"
            },
            {
              label: "Спектральная Рука",
              value: [`Создаёт бестелесную, мерцающую руку, которой можно проводить касательные атаки`],
              addition: "Некро"
            },
            {
              label: "Великолепие Орла",
              value: [`Субъект получает 1d4+1 Обн на
              1 мин./уровень`],
              addition: "Превр"
            },
            {
              label: "Взбирание по Паучьи",
              value: [`Даёт способность передви-
              жения по стенам и потолкам`],
              addition: "Превр"
            },
            {
              label: "Выносливость Медведя",
              value: [`Субъект получает 1d4+1 Тело
              на 1 мин./уровень`],
              addition: "Превр"
            },
            {
              label: "Грация Кошки",
              value: [`Субъект получает 1d4+1 Ловк на 1
              мин./уровень`],
              addition: "Превр"
            },
            {
              label: "Левитация",
              value: [`Субъект способен паря подниматься вверх
              или вниз`],
              addition: "Превр"
            },
            {
              label: "Мудрость Совы",
              value: [`Субъект получает 1d4+1 Мудр на
              1 мин./уровень`],
              addition: "Превр"
            },
            {
              label: "Пиротехника",
              value: [`Превращает огонь в ослепляющий свет
              или удушающий дым`],
              addition: "Превр"
            },
            {
              label: "Сила Быка",
              value: [`Субъект получает 1d4+1 Силы на
              1 мин./уровень`],
              addition: "Превр"
            },
            {
              label: "Собственное Изменение",
              value: [`Прием облика похожего существа`],
              addition: "Превр"
            },
            {
              label: "Стук",
              value: [`Открывает запертую магически или обычным
              замком дверь`],
              addition: "Превр"
            },
            {
              label: "Темновидение",
              value: [`Видеть до 18 м. от себя в полной темноте`],
              addition: "Превр"
            },
            {
              label: "Хитрость Лисы",
              value: [`Субъект получает 1d4+1 Интл на
              1 мин./уровень`],
              addition: "Превр"
            },
            {
              label: "Фокус с Верёвкой",
              value: [`До восьми существ могут скрыться
              в кармане сверх-измерения`],
              addition: "Превр"
            },
            {
              label: "Шепчущий Ветер",
              value: [`Передаёт короткое послание на
              1,6 км./уровень`],
              addition: "Превр"
            },
          ]
        }
      ]
    }
  ]
};
