export default {
  title: "Заклинания",
  urlPath: "/spells",
  links: [
    {
      name: "Заклинания жреца",
      key: "prst",
      data: [
        {
          name: "0-го уровня",
          key: "0-lvl",
          value: [
            {
              label: "Добродетель",
              value: [`Субъект получает 1 временный хит-поинт.`]
            },
            {
              label: "Лечение Мелких Ранений",
              value: [`Излечивает 1 пункт повреждений.`]
            },
            {
              label: "Обнаружение Магии",
              value: [
                `Определяет заклинания и магические
              предметы в пределах 18 м.`
              ]
            },
            {
              label: "Обнаружение Яда",
              value: [
                `Обнаруживает яд в одном существе или
                маленьком объекте.`
              ]
            },
            {
              label: "Очистить Пищу и Воду",
              value: [`Очищает 0,3 куб. м./уровень еды или воды.`]
            },
            {
              label: "Починка",
              value: [`Выполняет мелкий ремонт на объекте.`]
            },
            {
              label: "Причинить Мелкие Ранения",
              value: [
                `Касательная атака, 1 пункт
              повреждений.`
              ]
            },
            {
              label: "Руководство",
              value: [`+1 к одному броску атаки, спас-броску, проверке.`]
            },
            {
              label: "Свет",
              value: [`Объект сияет как факел.`]
            },
            {
              label: "Создать Воду",
              value: [`Создаёт 9 литров/уровень чистой воды`]
            },
            {
              label: "Устойчивость",
              value: [`Субъект получает + 1 бонус к спас-броскам`]
            },
            {
              label: "Чтение Магии",
              value: [
                `Даёт возможность читать свитки и книги
              заклинаний.`
              ]
            }
          ]
        },
        {
          name: "1-го уровня",
          key: "1-lvl",
          value: [
            {
              label: "Благословение",
              value: [
                `Союзники получают +1 к атаке и +1 к спасброскам против страха`
              ]
            },
            {
              label: "Благословить Воду(м)",
              value: [`Создаёт святую воду`]
            },
            {
              label: "Божье Расположение",
              value: [
                `Вы получает бонус +1/три уровня к атаке
              и повреждению.`
              ]
            },
            {
              label: "Защита от Добра/Закона/Зла/Хаоса",
              value: [
                `Защита от элементалей и
                внешних, даёт +2 к КД и спас-броскам, противостоит контролю
                над разумом.`
              ]
            },
            {
              label: "Команда",
              value: [
                `Один субъект подчиняется однословным командам на
                протяжении 1 раунда.`
              ]
            },
            {
              label: "Лечение Лёгких Ранений",
              value: [
                `Излечивает 1d8+1/уровень
                повреждений (макс. +5).`
              ]
            },
            {
              label: "Магический Камень",
              value: [
                `Три камня получают +1 бонус к атаке, и
                причиняют 1d6+1 повреждений.`
              ]
            },
            {
              label: "Магическое Оружие",
              value: [`Оружие получает +1 бонус.`]
            },
            {
              label: "Наслать Страх",
              value: [
                `Одно существо с 5 КХП и менее убегает в
              течение 1d4 раунда.`
              ]
            },
            {
              label: "Невидимость для Нежити",
              value: [
                `Нежить не замечает 1 субъекта/
                уровень.`
              ]
            },
            {
              label: "Обнаружение Добра/Закона/Зла/Хаоса",
              value: [
                `Показывает существ,
                заклинания или объекты.`
              ]
            },
            {
              label: "Обнаружение Нежити",
              value: [`Показывает нежить в пределах 18 м`]
            },
            {
              label: "Понимание Языков",
              value: [
                `Понимание всех разговорных и написанных
              языков.`
              ]
            },
            {
              label: "Призыв Монстра I",
              value: [`Призывает вам на помощь внешнее существо`]
            },
            {
              label: "Причинить Легкие Ранения",
              value: [
                `Касание причиняет 1d8+1/уровень
              повреждений (макс. +5).`
              ]
            },
            {
              label: "Проклясть Воду(м)",
              value: [`Создаёт проклятую воду.`]
            },
            {
              label: "Противостоять Элементам",
              value: [
                `Вы себя нормально чувствуете в
              холодной или горячей среде.`
              ]
            },
            {
              label: "Погибель",
              value: [
                `Один субъект страдает от штрафов -2 к броскам атаки
                и повреждения, спас-броскам, иным проверкам.`
              ]
            },
            {
              label: "Скрывающий Туман",
              value: [`Туман окружает вас.`]
            },
            {
              label: "Смертовзгляд",
              value: [
                `Показывает насколько сильно ранены субъекты
              в пределах 9 м`
              ]
            },
            {
              label: "Снять Страх",
              value: [`+4 к спас-броскам против страха; +1/четыре уровня`]
            },
            {
              label: "Убежище",
              value: [
                `Оппоненты не могут атаковать вас, а вы не можете
              атаковать их.`
              ]
            },
            {
              label: "Чума",
              value: [
                `Враги переносят штраф –1 к атаке, –1 к спас-броскам
                против страха.`
              ]
            },
            {
              label: "Щит Судьбы",
              value: [`Аура даёт вам +2 или выше бону отклонения.`]
            },
            {
              label: "Энтропический Щит",
              value: [`У стрелковых атак 20% шанс промаха по вам.`]
            }
          ]
        },
        {
          name: "2-го уровня",
          key: "2-lvl",
          value: [
            {
              label: "Вдребезги",
              value: [
                `Звуковая вибрация наносит повреждения объектам
              или кристаллическим существам.`
              ]
            },
            {
              label: "Великолепие Орла",
              value: [
                `Субъект получает 1d4+1 Обн на 1 час/
                уровень.`
              ]
            },
            {
              label: "Воззрить Оружие",
              value: [
                `Оружие становится добрым, законным, злым
                или хаотичным.`
              ]
            },
            {
              label: "Восстановление, Ограниченное",
              value: [
                `Рассеивает магический штраф
                к параметру, или восстанавливает 1d4 повреждений параметра.`
              ]
            },
            {
              label: "Выносливость Медведя",
              value: [
                `Субъект получает 1d4+1 Тело на 1 час/
                уровень.`
              ]
            },
            {
              label: "Духовное Оружие",
              value: [`Магическое оружие атакует своего владельца.`]
            },
            {
              label: "Заботливый Уход",
              value: [`Сохраняет одно погибшее тело.`]
            },
            {
              label: "Замедлить Яд",
              value: [
                `Замедляет разрушительный эффект яда на
              субъекта в течение 1 час/уровень.`
              ]
            },
            {
              label: "Зона Правды",
              value: [
                `В пределах зоны действия заклинания, субъекты
                не могут лгать.`
              ]
            },
            {
              label: "Лечение Средних Ранений",
              value: [
                `Излечивает 2d8+1/уровень
                повреждений (макс. +10).`
              ]
            },
            {
              label: "Мудрость Совы",
              value: [`Субъект получает 1d4+1 Мудр на 1 час/уровень.`]
            },
            {
              label: "Неопределимое Мировоззрение",
              value: [
                `Скрывает мировоззрение на 24
              часа.`
              ]
            },
            {
              label: "Обнаружение Ловушек",
              value: [`Возможность замечать ловушки как и вор`]
            },
            {
              label: "Освятить(м)",
              value: [
                `Заполняет зону позитивной энергией, делает нежить
              слабее.`
              ]
            },
            {
              label: "Осквернить(м)",
              value: [
                `Заполняет местность негативной энергией, делая
              в ней сильнее нежить`
              ]
            },
            {
              label: "Ощитить Других(ф)",
              value: [
                `Вы берёте на себя половину повреждений
              субъекта.`
              ]
            },
            {
              label: "Помощь",
              value: [
                `+1 к атаке, +1 к спас-броскам против страха, временные
              1d8 хит-поинтов.`
              ]
            },
            {
              label: "Порабощение",
              value: [`Ловит всё, что в пределах 30 м+3 м/уровень.`]
            },
            {
              label: "Предвестие(м,ф)",
              value: [
                `Даёт вам знать какое действие будет плохим, а
              какое хорошим.`
              ]
            },
            {
              label: "Призыв Монстра II",
              value: [`Призывает вам на помощь внешнее существо.`]
            },
            {
              label: "Причинить Средние Ранения",
              value: [
                `Касательная атака, 2d8+1/
              уровень повреждений (макс. +10).`
              ]
            },
            {
              label: "Сила Быка",
              value: [`Субъект получает 1d4+1 Силы на 1 час/уровень.`]
            },
            {
              label: "Смертельный Звон",
              value: [
                `Убивает существо при смерти; вы получает
              1d8 временных хит-поинтов, +2 Сила, и +1 уровень.`
              ]
            },
            {
              label: "Снять Паралич",
              value: [
                `Освобождает одно или более существ от
              парализа, удерживания, или замедления.`
              ]
            },
            {
              label: "Собрать Воедино",
              value: [`Ремонтирует объект.`]
            },
            {
              label: "Статус",
              value: [`Отслеживает состояние и положение союзников.`]
            },
            {
              label: "Струя Звука",
              value: [
                `Причиняет 1d8 звуковых повреждений субъектам;
              может их ошеломить.`
              ]
            },
            {
              label: "Темнота",
              value: [`Образуется сверхъестественная темнота радиусом в 6 м.`]
            },
            {
              label: "Тишина",
              value: [`Нейтрализует звук в зоне с радиусом 4,5 м.`]
            },
            {
              label: "Удержание Персоны",
              value: [
                `Делает одну персону беззащитной на
              протяжении 1 раунд/уровень.`
              ]
            },
            {
              label: "Успокоить Эмоции",
              value: [
                `Успокаивает 1d6 субъектов/уровень,
              нейтрализует эффекты эмоции.`
              ]
            },
            {
              label: "Устойчивость к Энергии",
              value: [
                `Игнорирует первые 12 повреждений/
              раунд от одного из типов энергии.`
              ]
            }
          ]
        },
        {
          name: "3-го уровня",
          key: "3-lvl",
          value: [
            {
              label: "Анимировать Мертвеца(м)",
              value: [`Создаёт скелетов и зомби.`]
            },
            {
              label: "Глиф Опеки(м)",
              value: [
                `Надписи повреждают того кто проходит через
              них.`
              ]
            },
            {
              label: "Глубокая Темнота",
              value: [
                `От объекта исходит абсолютная тьма в
              радиусе 18 метров.`
              ]
            },
            {
              label: "Глухота/Слепота",
              value: [`Делает субъекта глухим или слепым.`]
            },
            {
              label: "Говорить с Мёртвыми",
              value: [
                `Труп отвечает на один вопрос/два уровня.
              Дневной Свет: Яркий свет с радиусом 18 м.`
              ]
            },
            {
              label: "Дневной Свет",
              value: [`Яркий свет с радиусом 18 м.`]
            },
            {
              label: "Дыхание под Водой",
              value: [`Субъект способен дышать под водой.`]
            },
            {
              label: "Защита от Энергии",
              value: [
                `Поглощает 12 повреждений/уровень одного
              из видов энергии.`
              ]
            },
            {
              label: "Излечить Болезнь",
              value: [`Излечивает все болезни у субъекта.`]
            },
            {
              label: "Инфекция",
              value: [`Заражает субъекта определенной болезней.`]
            },
            {
              label: "Круг Волшебства против Добра/Закона/Зла/Хаоса",
              value: [
                `Как заклинание защита, но с радиусом 3 м и 10 мин./уровень.`
              ]
            },
            {
              label: "Лечение Серьёзных Ранений",
              value: [
                `Излечивает 3d8+1/уровень
              повреждений (макс. +15).`
              ]
            },
            {
              label: "Магическое Одеяние",
              value: [
                `Доспехи или щит получают +1 бонус
              колдовства/три уровня.`
              ]
            },
            {
              label: "Молитва",
              value: [
                `Союзники получают +1 к броскам атаки, противники
              –1 штраф.`
              ]
            },
            {
              label: "Наложить Проклятие",
              value: [
                `–6 к параметру; –4 к атакам; спас-броскам
              и проверкам; или 50% шанс потери своего действия.`
              ]
            },
            {
              label: "Обнаружить Объект",
              value: [
                `Указывает направление к объекту
              (специфическому или разновидности).`
              ]
            },
            {
              label: "Очищение Невидимости",
              value: [
                `Рассеивает невидимость в пределах
              1,5 м./уровень.`
              ]
            },
            {
              label: "Призыв Монстра III",
              value: [`Призывает вам на помощь внешнее существо.`]
            },
            {
              label: "Причинить Серьёзные Ранения",
              value: [
                `Касательная атака 3d8+1/
              уровень повреждений (макс. +15).`
              ]
            },
            {
              label: "Продолжительное Пламя(м)",
              value: [
                `Создаёт постоянный, не
              излучающий тепла факел.`
              ]
            },
            {
              label: "Прожигающий Луч",
              value: [
                `Луч причиняет 1d8/два уровня повреждений,
              нежити ещё больше.`
              ]
            },
            {
              label: "Рассеивание Магии",
              value: [`Снимает магические эффекты и заклинания.`]
            },
            {
              label: "Рука Помощи",
              value: [`Призрачная рука приводит к вам субъекта.`]
            },
            {
              label: "Скрыть Объект",
              value: [`Маскирует объект от ворожбы.`]
            },
            {
              label: "Слиться с Камнем",
              value: [`Вы и ваше снаряжение сливается с камнем.`]
            },
            {
              label: "Создать Воду и Пищу",
              value: [
                `Создаёт такое количество, чтобы
              накормить/напоить трёх человек (или одну лошадь)/уровень.`
              ]
            },
            {
              label: "Снять Глухоту/Слепоту",
              value: [
                `Излечивает обычное или магическое
              состояние.`
              ]
            },
            {
              label: "Снять Проклятие",
              value: [`Освобождает объект или персону от проклятия.`]
            },
            {
              label: "Стена Ветра",
              value: [`Отклоняет стрелы, небольших существ и газы.`]
            },
            {
              label: "Форма Камня",
              value: [
                `Заставляет камень принять указанную вами
              форму.`
              ]
            },
            {
              label: "Хождение по Воде",
              value: [
                `Субъекты передвигаются по воде как по
              твёрдой поверхности.`
              ]
            }
          ]
        }
      ]
    }
  ]
};
