// @flow
import type { pageContentType } from '@/components/page'

export const HALF_ELF_PAGE: pageContentType = {
  TITLE: 'Полуэльфы',
  URL: '/race/half-elf',
  isNavigationPage: false,
  parentUrl: '/race',
  TABS: [
    {
      NAME: 'Описание',
      TAB_KEY: 'description',
      PARAGRAPHS: [
        {
          VALUE: [
            `Люди и эльфы очень часто женятся, эльфов привлекает энергия людей, людей изящество эльфов. Эти браки очень скоротечны, так как жизнь людей очень коротка, но у них остаётся
            стойкое наследие – полуэльфийские дети.`,
            `Жизнь полуэльфов трудна. Выращенные эльфами, полуэльфы взрослеют очень быстро, достигая зрелости в первые
            два десятилетия. Они становятся взрослыми задолго до того
            как, необходимо время изучить сложность эльфийской культуры и искусства, или даже грамматики. И хотя его друзья
            по детству, физически становятся зрелыми, по эльфийским
            стандартам они ещё долго будут оставаться детьми. Обычно
            полуэльфы покидают свой эльфийский дом, когда их с ним
            практически ничего не связывает, они ищут свою судьбу среди людей. С другой стороны, выращенный среди людей, полуэльф замечает, что непохож на окружающих: более отчужденный, чувствительный, менее амбициозный, и медленнее
            взрослеющий. Некоторые полуэльфы стараются стать похожими на людей, в то время другие находят себя в том, что
            они отличаются от других. Большинство находят свое место
            в жизни в людских общинах, но остаются те, кто всю свою
            жизнь чувствуют себя посторонними в этой толпе людей.`,
          ],
        },
      ],
    },
    {
      NAME: 'Индивидуальность',
      TAB_KEY: 'individuality',
      PARAGRAPHS: [
        {
          VALUE: [
            `Большинство полуэльфов любознательны, находчивы и честолюбивы как их родители люди, но
            вместе с тем в них присутствуют чувства любви к природе,
            художественный вкус от эльфийских родителей.`,
          ],
        },
      ],
    },
    {
      NAME: 'Внешность',
      TAB_KEY: 'appearance',
      PARAGRAPHS: [
        {
          VALUE: [
            `Людям кажется, что полуэльфы похожи на эльфов, эльфы в свою очередь считают, что они больше похожи
            на людей (эльфы и называют их «полу-люди»). Средний рост
            полуэльфа от 150 до почти 180 сантиметров, вес в пределах
            36 – 72 килограмм. Мужчины полуэльфы обычно выше и
            тяжелее, чем женщины полуэльфы, но эта разница не столь
            ярко выражена, как у людей. Они более бледны, красивее и
            менее волосаты, чем люди, но все же цвет кожи, волос, и другие черты явно указывают на присутствие крови людей. Глаза
            у полуэльфов зеленые, как и у их эльфийских родителей. В
            20 лет полуэльф достигает зрелости, срок жизни в пределах
            180 лет.`,
            `Большинство полуэльфов дети от браков: отец человек
            – мать эльфийка. Некоторые, иногда, дети от браков где, отец
            или мать уже на половину человек или эльф. У детей «второго
            поколения», бывают глаза таких цветов, как и у людей. Хотя
            большинство, все же наследуют зеленый цвет.`,
          ],
        },
      ],
    },
    {
      NAME: 'Отношения',
      TAB_KEY: 'relations',
      PARAGRAPHS: [
        {
          VALUE: [
            `Эльфы нормально относятся как к людям,
            так и к эльфам, их так же можно встретить рядом с дварфами,
            гномами, халфлингами. Они обладают эльфийской грацией,
            но не имеют эльфийской отчужденности, человеческую энергию, но не имеют человеческую невоспитанность. Из них
            выходят превосходные послы и дипломаты (за исключением
            действий между людьми и эльфами, так как каждая сторона
            предполагает что полуэльф поддерживает других). Однако,
            в землях людей, где эльфов мало или с ними находятся не в дружественных отношениях, на полуэльфов смотрят с подозрением.`,
            `Некоторые полуэльфы открыто выражают свою неприязнь к полуоркам. Возможно схожесть их в происхождении
            (оба имеют предков людей), заставляют полуэльфов чувствовать себя стесненными`,
          ],
        },
      ],
    },
    {
      NAME: 'Мировоззрение',
      TAB_KEY: 'ideolody',
      PARAGRAPHS: [
        {
          VALUE: [
            `Полуэльфам свойственна хаотичность,
            как наследие от их эльфийских родителей, но, от людей, они
            не стремятся ни к добру ни к злу. Как эльфы, они ценят личную свободу и яркое самовыражение, выражая равнодушие
            граничащее с нелюбовью к лидерам, не желанием иметь последователей. Их раздражают правила, заставляющие кого-то
            зависеть от другого, и иногда показывают это в своей ненадежности, или как минимум в непредсказуемости.`,
          ],
        },
      ],
    },
    {
      NAME: 'Земли полуэльфом',
      TAB_KEY: 'land-of-half-elf',
      PARAGRAPHS: [
        {
          VALUE: [
            `Полуэльфы не имеют как таковых собственных земель, хотя им радушны в челове-ческих городах, и эльфийских лесах. В больших городах,
            очень часто полуэльфы формируют свои небольшие общины.`,
          ],
        },
      ],
    },
    {
      NAME: 'Религия',
      TAB_KEY: 'religion',
      PARAGRAPHS: [
        {
          VALUE: [
            `Полуэльфы воспитанные эльфами покло-няются эльфийским богам, в основном Кореллону Ларефйану,
            верховному богу эльфов. Те, кто был воспитан среди людей,
            очень часто поклоняются Эхлонне, богине лесной местности.`,
          ],
        },
      ],
    },
    {
      NAME: 'Языки',
      TAB_KEY: 'languages',
      PARAGRAPHS: [
        {
          VALUE: [
            `Полуэльфы разговаривают на тех языках, на
            которых они начинали общаться с самого детства, Общий и
            Эльфийский. Они говорят нескладно на замысловатом Эльфийском языке, хотя это замечают лишь эльфы, в остальном
            они говорят лучше даже чем все другие не-эльфы.`,
          ],
        },
      ],
    },
    {
      NAME: 'Имена',
      TAB_KEY: 'names',
      PARAGRAPHS: [
        {
          VALUE: [
            `У полуэльфов имена имеют как людское, так и
            эльфийское происхождение. По иронии, полуэльфы проживающие среди людей берут себе эльфийское имя, что бы указать
            на свое происхождение, а те, что выросли среди эльфов, выбирают себе людские имена.`,
          ],
        },
      ],
    },
    {
      NAME: 'Искатели приключений',
      TAB_KEY: 'adventurers',
      PARAGRAPHS: [
        {
          VALUE: [
            `Очень часто полуэльфов можно
            увидеть в необычных компаниях, или занимающихся неординарной профессией. Жизнь искателя приключений манит большую
            часть из них. Как и у эльфов, у них острая тяга к путешествиям.`,
          ],
        },
      ],
    },
    {
      NAME: 'Расовые особенности полуорков',
      TAB_KEY: 'racial-characteris',
      PARAGRAPHS: [
        {
          LABEL: 'Среднего размера',
          VALUE: [
            `Как существа среднего роста, полуэльфы не
            имеют каких-то бонусов или штрафов из-за своего роста.`,
          ],
        },
        {
          LABEL: 'Базовая скорость полуэльфа 9 метров',
        },
        {
          LABEL:
            'Иммунитет к заклинаниям сон и подобным магическим эффектам, +2 расовый бонус к спасброскам против заклинаний очарование или подобным эффектам.',
        },
        {
          LABEL: 'Зрение при низком освещении',
          VALUE: [
            `Полуэльфы видят в два
            раза дальше чем люди, при лунном, звездном свете, а также при свете, излучаемом факелом, или условиях низкой
            освещенности. В таких условиях они сохраняют способность различать цвета и детали объектов, существ.`,
          ],
        },
        {
          LABEL:
            '+1 расовый бонус к проверкам Прислушивания, Поиска, Отслеживание',
          VALUE: [
            `У полуэльфов нет эльфийской способности
            обнаружить потайные двери, просто проходя мимо них. У
            них не настолько остро развиты чувства.`,
          ],
        },
        {
          LABEL: 'Эльфийская Кровь',
          VALUE: [
            `Для различных специальных свойств и эффектов касающихся расы эльф, полуэльф восприни-мается
            как эльф. К примеру, полуэльф столь же уязвим к определенным эффектам как и его предки, может использовать
            особое эльфийское оружие, или магические предметы которые дают особые силы, если его держит эльф. (Смотрите
            Справочник Монстров за дополнительной информацией об
            эльфах, и Руководство Мастера Подземелий о магических
            предметах).`,
          ],
        },
        {
          LABEL: '+2 расовый бонус к проверкам Дипломатии и Сбора Информации',
          VALUE: [
            `Полуэльфы постоянно имеют дело с различными
            людьми.`,
          ],
        },
        {
          LABEL: `Автоматический язык: Общий и Эльфийский. Бонусные языки: Любые (За исключением секретных языков, такие как:
            язык Друидов).`,
          VALUE: [
            `У полуэльфов такая же многосторонность и
            обширность взглядов, как и у людей`,
          ],
        },
        {
          LABEL: `Желаемый класс: Любой`,
          VALUE: [
            `При определении страдает ли от
            штрафов персонаж полуэльф при мультиклассе, то, его более высоко развитый класс не учитывается (смотрите Опыт
            для Мультиклассовых персонажей стр. 60).`,
          ],
        },
      ],
    },
  ],
}
